@extends('layouts.main')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคสมองเสื่อม</h1>
        <p style="text-indent: 50px;"> เป็นภาวะที่สมองมีการทำงานแย่ลงจนส่งผลต่อชีวิตประจำวัน ประกอบด้วยกลุ่มอาการหลายๆ
            อย่างรวมกัน เช่น หลงลืมง่าย คิดเงินไม่ถูก หาของไม่เจอ หลงทางในที่คุ้นเคย มีพฤติกรรมแปลกๆ เป็นต้น</p>
        <h4>สาเหตุของโรคสมองเสื่อม</h4>
        <p style="text-indent: 50px;">สาเหตุของโรคสมองเสื่อมเกิดจากสาเหตุที่ไม่ชัดเจน
            ทราบเพี่ยงการเปลี่ยนแปลงหลายอย่างในสมองจนทำให้สมองทำงานหน้าที่ลดลงและเหี่นวลงไป สมองเสื่อมไม่ได้เป็นโรคติดต่อ
            แต่อาจมีการถ่ายทอดในครอบครัวทางกรรมพันธุ์ได้ในผู้ป่วยส่วนน้อย ส่วนใหญ่จะไม่ถ่ายทอดทางกรรมพันธุ์
            ปัจจัยเสี่ยงที่สำคัญคือ อายุมากขึ้น โดยจะพบมากขึ้นสองเท่าทุก5ปี และเนื่องจากปัจจุบันนี้คนเราอายุยืนขึ้น
            โรคจึงพบได้มากขึ้นเรื่อยๆ</p>
        <h4>อาหารประเภทไหน ช่วยป้องกันและชะลออาการของโรคสมองเสื่อม </h4>
        <ul>
            <li>โอเมก้า 3 (Omega 3) โดยจะพบมากในปลาทะเล เช่น ปลาทู ปลาทูน่า ปลาซาบะ ปลาแซลมอน ปลาโอ (รับประทาน 2-3
                ครั้งต่อสัปดาห์) </li>
            <li>อาหารต้านอนุมูลอิสระ (Antioxidant) เนื่องจากอนุมูลอิสระเป็นพิษต่อเซลล์ในร่างกาย รวมทั้งเซลล์สมอง
                พบมากในลูกพรุน สตรอเบอรี่ บลูเบอรี่ ลูกม่อน ผลทับทิม แอปเปิ้ล เป็นต้น สำหรับเครื่องเทศพบมากในพริก พริกไทย
                กระเทียม ขิง </li>
            <li>โคลีน (Choline) เป็นสารอาหารที่จำเป็นต่อการสร้างสารสื่อประสาทที่เรียกว่า อะเซทิลโคลีน พบมากในถั่วเหลือง
                ไข่แดง ถั่วลิสง ผักใบเขียว ธัญพืชและถั่วเมล็ดแห้ง ปลา จมูกข้าวสาลี ข้าวโอ๊ต ข้าวกล้อง กล้วย ข้าวโพด
                เครื่องในสัตว์ กะหล่ำปลี และกะหล่ำดอก </li>
            <li>อาหารในกลุ่มแป้ง (Carbohydrate) ควรเน้นเป็นกลุ่มที่มีโครงสร้างเชิงซ้อน เช่น ข้าวกล้อง ข้าวซ้อมมือ ข้าวโอ๊ต
                และธัญพืช </li>
            <li>วิตามินและเกลือแร่เสริม (Vitamins and Mineral supplements) รับประทานอย่างเหมาะสม (ตามที่แพทย์พิจารณา) </li>
            <li>รับประทานอาหารที่ให้ครบ5หมู่</li>
            <li>หลีกเลี่ยงการสูบบุหรี่ ดื่มเครื่องดื่มแอลกอฮอล์ เพราะทำให้เซลล์สมองเสื่อมเร็วขึ้น</li>
            <li>ลดอาหารจำพวกไขมันมาก</li>
        </ul>
        <h4>อาหารที่ผู้สูงอายุควรหลีกเลี่ยง</h4>
        <ul>
            <li>อาหารกลุ่มไขมันอิ่มตัวจากสัตว์ ได้แก่ มันหมู มันไก่ เนย เนยเทียม ครีมเทียม มาการีน</li>
            <li>อาหารกลุ่มไขมันอิ่มตัวจากพืช ได้แก่ กะทิ, น้ำมันปาล์ม, น้ำมันมะพร้าว
            </li>
            <li>อาหารที่มีน้ำตาลสูง อาทิ ขนมหวาน หรือเครื่องดื่มต่างๆ เพราะความหวานจะทำให้ร่างกายเกิดการอักเสบ
                ทำให้เซลล์ประสาทที่เชื่อมต่อไปสมองเกิดความเสียหาย หรือทำงานได้ไม่ดี ซึ่งอาจส่งผลต่อสมองในที่สุด</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคสมองเสื่อม</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
