@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/dementia.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3 fs-5" style="width: 900px">
        <h1>ภาวะสมองเสื่อม</h1>
        <p style="text-indent: 50px;">ภาวะสมองเสื่อม หรือ Dementia คือ กลุ่มอาการที่ส่งผลต่อความสามารถด้านความคิดความเข้าใจ
            เช่น การรับรู้ การคิด การจดจำ ผู้ที่มีภาวะนี้อาจมีอาการ เช่น นึกคำพูดไม่ออก สูญเสียความทรงจำ วิตกกังวล
            ขาดความสามารถในการตัดสินใจ ซึ่งอาจส่งผลกระทบต่อการใช้ชีวิตประจำวันได้เป็นอย่างมาก องค์การอนามัยโลกชี้ว่า
            ในปัจจุบันมีผู้ป่วยภาวะสมองเสื่อมมากกว่า 55 ล้านคนทั่วโลก และจำนวนผู้ป่วยอาจเพิ่มขึ้นในทุก ๆ ปี ซึ่งอย่างไรก็ตาม
            การศึกษาวิธีป้องกันภาวะสมองเสื่อมอาจช่วยลดความเสี่ยงในการเกิดภาวะนี้ได้</p>
        <h4>Dementia คือ อะไร</h4>
        <p>Dementia คือ ภาวะสมองเสื่อม เป็นกลุ่มอาการที่เกิดจากความผิดปกติของเปลือกสมองซึ่งเป็นส่วนนอกสุดของสมอง
            หรือเกิดจากประสิทธิภาพการทำงานของสมองค่อย ๆ เสื่อมลง จนส่งผลต่อความสามารถด้านความคิดความเข้าใจ (Cognitive
            functioning) เช่น การรับรู้ การคิด การจดจำ การใช้เหตุผล จนบางครั้งอาจกระทบต่อการใช้ชีวิตประจำวัน
            ผู้ป่วยภาวะสมองเสื่อมบางคนอาจควบคุมอารมณ์ไม่ได้ และบุคลิกภาพอาจเปลี่ยนไป
            ภาวะนี้มีตั้งแต่ระยะไม่รุนแรงจนถึงระยะรุนแรงที่อาจกระทบต่อการใช้ชีวิตประจำวันเป็นอย่างมากและจำเป็นต้องได้รับความช่วยเหลือจากผู้อื่น
        </p>
        <h4>อาการของ Dementia หรือภาวะสมองเสื่อม</h4>
        <p>อาการของ dementia อาจจำแนกประเภทได้ดังนี้</p>
        <strong>การเปลี่ยนแปลงทางสติปัญญา</strong>
        <ul>
            <li>สับสน</li>
            <li>ลืมง่าย แม้สถานการณ์เพิ่งผ่านไปไม่นาน </li>
            <li>มีปัญหาด้านการสื่อสาร</li>
            <li>มีปัญหาด้านการแก้ไขปัญหา การใช้เหตุผล</li>
            <li>มีปัญหาในการเคลื่อนไหวประสานงานกันของร่างกาย</li>
            <li>มีปัญหาในการจัดการหรือวางแผนที่จะทำสิ่งต่าง ๆ</li>
        </ul>
        <strong>การเปลี่ยนแปลงทางจิตใจ</strong>
        <ul>
            <li>วิตกกังวล หวาดระแวง</li>
            <li>ซึมเศร้า</li>
            <li>เห็นภาพหลอน</li>
            <li>มีบุคลิกภาพเปลี่ยนไป เช่น ไม่กระตือรือร้น เดินท่าแปลกไป</li>
            <li>มีพฤติกรรมก้าวร้าว หงุดหงิดง่าย</li>
        </ul>
        <h4>สาเหตุของ Dementia หรือภาวะสมองเสื่อม</h4>
        <p>ภาวะสมองเสื่อมอาจเกิดจากสาเหตุดังต่อไปนี้</p>
        <ul>
            <li>การเปลี่ยนแปลงที่เกิดขึ้นกับสมอง เนื่องจากระบบการทำงานของสมองค่อย ๆ เสื่อม</li>
            <li>การขาดวิตามิน เช่น วิตามินบี 1 วิตามินบี 6 วิตามินบี 12 หากได้รับวิตามินบี 1
                ไม่เพียงพออาจส่งผลทำให้เซลล์สมองทำงานไม่ได้ตามปกติและเซลล์เนื้อสมองตายได้ </li>
            <li>หลอดเลือดสมองตีบจนอาจส่งผลให้เลือดไปเลี้ยงสมองไม่เพียงพอและทำให้เนื้อสมองตาย</li>
            <li>การแปรปรวนของระบบเมตาบอลิกในร่างกาย เช่น ต่อมไร้ท่อบางชนิดทำงานผิดปกติ ตับและไตทำงานได้ไม่เต็มประสิทธิภาพ
                ส่งผลให้สมองไม่สามารถทำงานได้ตามปกติ </li>
            <li>การติดเชื้อในสมอง เช่น โรคไข้สมองอักเสบ ที่เกิดจากการติดเชื้อไวรัส เชื้อแบคทีเรีย เป็นต้น
                ส่งผลให้เกิดการอักเสบในสมอง และสมองทำงานผิดปกติ</li>
            <li>เนื้องอกในสมองอาจส่งผลให้สมองเสื่อมได้</li>
            <li>การกระทบกระเทือนบริเวณศีรษะเป็นประจำ หรือการเกิดอุบัติเหตุที่ส่งผลต่อศีรษะ</li>
        </ul>
        <h4>ปัจจัยเสี่ยงของ Dementia หรือภาวะสมองเสื่อม</h4>
        <p>ภาวะสมองเสื่อมอาจมีปัจจัยเสี่ยงดังต่อไปนี้</p>
        <ul>
            <li><span><strong>อายุ</strong></span> โดยเฉพาะผู้ที่มีอายุ 65 ปี ขึ้นไป
                เมื่ออายุเพิ่มขึ้นการทำงานของระบบสมองก็จะเริ่มเสื่อมลง</li>
            <li><span><strong>พันธุกรรม</strong></span>
                มีประวัติคนในครอบครัวเป็นภาวะสมองเสื่อมอาจส่งผลให้มีความเสี่ยงในการเกิดภาวะสมองเสื่อมเพิ่มขึ้น</li>
            <li><span><strong>สูบบุหรี่</strong></span> การสูบบุหรี่อาจเพิ่มความเสี่ยงในการเป็นโรคสมองเสื่อมและโรคหลอดเลือด
            </li>
            <li><span><strong>ปัญหาด้านสุขภาพ</strong></span> เช่น โรคเบาหวาน โรคความดันโลหิตสูง โรคหัวใจและหลอดเลือด</li>
        </ul>
        <h4>วิธีป้องกัน Dementia หรือภาวะสมองเสื่อม</h4>
        <p>ภาวะสมองเสื่อมอาจไม่มีวิธีป้องกันได้ 100 % แต่วิธีต่อไปนี้อาจช่วยลดโอกาสในการเกิดภาวะสมองเสื่อมได้</p>
        <ul>
            <li>รับประทานอาหารที่มีประโยชน์ เช่น ผัก ผลไม้ รวมถึงอาหารที่อุดมไปด้วยโอเมก้า 3
                อาจช่วยลดความเสี่ยงสมองเสื่อมได้</li>
            <li>ออกกำลังกายอย่างสม่ำเสมอ เช่น เดิน วิ่ง ปั่นจักรยาน อย่างน้อย 30-45 นาที/วัน หรือ 3-5 วัน/สัปดาห์ </li>
            <li>นอนหลับพักผ่อนให้เพียงพอ อย่างน้อย 7-8 ชั่วโมง </li>
            <li>เลิกสูบบุหรี่ เพราะในบุหรี่มีสารนิโคตินและสารอื่น ๆ ที่อาจทำให้หลอดเลือดแดงตีบตัน
                รวมถึงอาจส่งผลกระทบต่อระบบต่าง ๆ ในร่างกายได้</li>
            <li>ฝึกฝนสมอง พยายามทำให้สมองได้คิดอยู่เป็นประจำ เช่น เล่นเกมทายคำศัพท์ ทายปริศนา อ่านหนังสือ</li>
            <li>ตรวจสุขภาพประจำปี เพื่อตรวจหาความเสี่ยงและความเสื่อมของร่างกายในเบื้องต้น</li>
            <li>ระมัดระวังอุบัติเหตุต่าง ๆ โดยเฉพาะอุบัติเหตุที่ศีรษะ เช่น การหกล้ม การเล่นกีฬา</li>
        </ul>
        <h4>ลดความเสี่ยงภาวะสมองเสื่อม ด้วย 5 วิธีง่าย ๆ ที่ใครก็ทำได้</h4>
        <p>ภาวะสมองเสื่อม เป็นหนึ่งในปัญหาสุขภาพที่มีอัตราการเติบโตเร็วที่สุดในโลก
            ภาวะสมองเสื่อมเป็นภาวะที่ผู้ป่วยมักมีปัญหาเกี่ยวกับความจำและความคิด ซึ่งส่งผลต่อผู้คนประมาณ 50 ล้านคนทั่วโลก
            นอกจากนี้องค์กรอนามัยโลก (WHO) ยังคาดการณ์ว่าน่าจะมีผู้ป่วยเพิ่มขึ้นเป็น 3 เท่าใน 30 ปีข้างหน้า
            แม้ว่าภาวะสมองเสื่อมนั้นจะยังไม่มีวิธีในการรักษา แต่วันนี้ Hello คุณหมอ มีวิธีการปฏิบัติตัวอย่างง่าย ๆ 5 วิธี
            ที่ช่วย ลดความเสี่ยงภาวะสมองเสื่อม ได้</p>
        <h4>5 วิธี ลดความเสี่ยงภาวะสมองเสื่อม</h4>
        <p>อายุที่มากขึ้นก็มักจะมาพร้อมกับปัญหาสุขภาพมากมาย ปัญหาภาวะสมองเสื่อม
            เป็นอีกหนึ่งปัญหาสุขภาพที่มักจะเกิดเมื่ออายุมากขึ้น แม้ภาวะสมองเสื่อมจะยังไม่มีวิธีการรักษา
            แต่การปฏิบัติตัวที่ดีก็มีส่วนช่วยในการลดความเสี่ยงในการเกิดภาวะสมองเสื่อมได้ ดังนี้</p>
        <ul>
            <li>
                <h4>รับประทานอาหารที่ดีต่อสุขภาพ</h4>
                <p>การเลือกรับประทานอาหารที่ดีต่อสุขภาพ ถือเป็นเรื่องพื้นฐานที่ช่วยให้มีสุขภาพที่ดีขึ้นได้
                    อีกทั้งยังมีส่วนช่วยลดความเสี่ยงในการเกิดโรคต่าง ๆ เช่น <span><a href="">โรคเบาหวาน</a></span>
                    <span><a href="">โรคหัวใจ</a></span>
                    ที่สำคัญการรับประทานอาหารที่ดีต่อสุขภาพนั้นยังส่งผลดีต่อสมองอีกด้วย องค์กรอนามัยโลก (WHO)
                    ได้แนะนำว่าการบริโภคผลไม้ ผัก ปลา ถั่ว น้ำมันมะกอก และกาแฟ
                    อาหารเหล่านี้ล้วนมีส่วนช่วยในการลดความเสี่ยงในการเกิดภาวะสมองเสื่อมได้ทั้งสิ้น
                </p>
            </li>
            <li>
                <h4>ออกกำลังกายอย่างสม่ำเสมอ</h4>
                <p>นักวิจัยพบว่าการออกกำลังกายเป็นประจำนั้นส่งผลดีต่อสมอง จากการศึกษาในปี 2019 พบว่า
                    ผู้ที่มีการออกกำลังกายเป็นประจำ มีอาการของภาวะสมองเสื่อมน้อยกว่าผู้ไม่ออกกำลังกาย
                    ดังนั้นการออกกำลังกายอย่างสม่ำเสมอจึงช่วยลดความเสี่ยงในการเกิดภาวะสมองเสื่อมได้
                    โดยควรออกกำลังกายระดับปานกลาง เป็นเวลา 150 นาทีต่อสัปดาห์</p>
            </li>
            <li>
                <h4>งดสูบบุหรี่และงดการดื่มเครื่องดื่มแอลกอฮอล์</h4>
                <p>จากการวิจัยพบว่าผู้ที่สูบบุหรี่จะมีความเสี่ยงในการเกิดภาวะสมองเสื่อมมากกว่าปกติ
                    นอกจากนี้ยังข้อมูลจากองค์กรอนามัยโลกยังบอกอีกว่าการดื่มเบียร์หรือเครื่องดื่มแอลกอฮอล์อื่น ๆ
                    แม้จะในปริมาณที่เล็กน้อยก็ตาม ก็ส่งผลทำให้เกิดความเสี่ยงต่อการเกิดภาวะสมองเสื่อมได้</p>
            </li>
            <li>
                <h4>บริหารสมอง</h4>
                <p>การบริหารสมอง เป็นอีกหนึ่งวิธีที่มีส่วนช่วยในการลดความเสี่ยงต่อการเกิดภาวะสมองเสื่อมได้
                    เมื่อสมองได้ใช้งานอยู่เสมอ สมองก็จะทำงานได้ดี ซึ่งมีกิจกรรมมากมายที่ช่วยบริหารสมองได้ เช่น การเล่นซูโดกุ
                    การศึกษาภาษาใหม่ ๆ การเล่นบอร์ดเกม หรือเกมที่ต้องใช้ความคิดในการเล่น</p>
            </li>
            <li>
                <h4>ตรวจสุขภาพอย่างสม่ำเสมอ</h4>
                <p>การตรวจสุขภาพอย่างสม่ำเสมอ เป็นอีกหนึ่งวิธีดูแลตัวเองที่ดี
                    ไม่เพียงแต่ช่วยป้องกันการเกิดภาวะสมองเสื่อมเท่านั้น แต่ยังมีส่วนช่วยป้องกันในการเกิดโรคอื่น ๆ อีกด้วย
                    การตรวจร่างกายเป็นประจำช่วยให้รับรู้ถึงการเปลี่ยนแปลงในร่างกายได้
                    หากเกิดความผิดปกติก็ยังสามารถรักษาได้อย่างทันถ่วงที</p>
            </li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคสมองเสื่อม</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
