@extends('layouts.main')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคเบาหวาน</h1>
        <p style="text-indent: 50px;">โรคเบาหวาน(Diabetes) คือโรคที่เกิดจากความผิดปกติของการทำงานของฮอร์โมนที่ชื่อว่า อินสุลิน
            (Insulin) ซึ่งโดยปกติแล้วร่างกายของคนเราจำเป็นต้องมีอินสุลิน เพื่อนำน้ำตาลในกระแสเลือดไปเลี้ยงอวัยวะต่าง ๆ
            ของร่างกาย โดยเฉพาะสมองและกล้ามเนื้อ ในภาวะที่อินสุลินมีความผิดปกติ
            ไม่ว่าจะเป็นการลดลงของปริมาณอินสุลินในร่างกาย หรือการที่อวัยวะต่าง ๆ ของร่างกายตอบสนองต่ออินสุลินลดลง
            (หรือที่เรียกว่า ภาวะดื้ออินสุลิน)
            จะทำให้ร่างกายไม่สามารถนำน้ำตาลที่อยู่ในกระแสเลือดไปใช้ได้อย่างเต็มประสิทธิภาพ
            ทำให้มีปริมาณน้ำตาลคงเหลือในกระแสเลือดมากกว่าปกติ</p>
            <h4>สาเหตุของโรคเบาหวาน</h4>
        <p style="text-indent: 50px;">สาเหตุของโรคเบาหวานเกิดจากการที่ระดับน้ำตาลในกระแสเลือดสูงมากขึ้นถึงระดับหนึ่ง
            จนทำให้ไตดูดกลับน้ำตาลได้ไม่หมด ซึ่งปกติไตจะมีหน้าที่ดูดกลับน้ำตาลจากสารที่ถูกกรองจากหน่วยไตไปใช้
            ส่งผลให้มีน้ำตาลรั่วออกมากับปัสสาวะ จึงเป็นที่มาของคำว่า “โรคเบาหวาน” หากเราปล่อยให้เกิดภาวะเช่นนี้ไปนาน ๆ
            โดยไม่ได้รับการรักษาอย่างถูกวิธี จะทำให้เกิดภาวะแทรกซ้อนที่ร้ายแรงตามมาในที่สุด</p>
        <h4>อาหารที่ควรหลีกเลี่ยง เป็นอาหารที่ทำให้น้ำตาลในเลือดสูงขึ้นอย่างรวดเร็ว ได้แก่</h4>
        <ul>
            <li>อาหารที่มีน้ำตาลเป็นส่วนประกอบ เช่น เค้ก คุกกี้ ไอศกรีม ขนมหวาน และช็อกโกแลต</li>
            <li>เครื่องดื่มที่มีน้ำตาล เช่น น้ำหวาน น้ำอัดลม นมเปรี้ยว นมปรุงแต่งรส น้ำผลไม้ เครื่องดื่มชูกำลัง และน้ำเกลือแร่</li>
        </ul>
        <h4>อาหารที่รับประทานได้แต่ควรกำหนดปริมาณ</h4>
        <ul>
            <li>รับประทานอาหารที่ให้พลังงานสูง เนื้อ ไขมัน แป้ง ของหวาน</li>
            <li>อาหารประเภทโปรตีน ได้แก่ เนื้อสัตว์ต่างๆ ไข่ นม ผลิตภัณฑ์จากนม ปริมาณ 3-5 ส่วนต่อวัน</li>
            <li>อาหารไขมัน ได้แก่ ไขมันสัตว์ หนังสัตว์ติดมัน น้ำมันพืช ปริมาณ 3-5 ส่วนต่อวัน</li>
            <li>ผลไม้ นอกจากจะมีวิตามิน เกลือแร่และกากใยอาหารสูงแล้วยังมีน้ำตาลด้วยจึงต้องจำกัดปริมาณที่รับประทานไม่เกิน 3
                ส่วนต่อวัน</li>
            <li>นมและผลิตภัณฑ์ ควรดื่มนมจืดพร่องไขมัน ที่ไม่ปรุงแต่งรสวันละ 1-2 แก้ว</li>
            <li>แอลกอฮอล์ บางชนิดมีส่วนประกอบของคาร์โบไฮเดรตมาก</li>
            <li>เกลือ จะทำให้ความดันโลหิตสูง เพราะเกลือทำให้ร่างกายกักเก็บน้ำไว้มากขึ้น แนะนำรับประทานไม่เกิน 2000
                มิลลิกรัม/วัน</li>
        </ul>
        <h4>อาหารที่รับประทานได้ไม่จำกัด เป็นอาหารที่ให้พลังงานต่ำมีกากใยมาก</h4>
        <ul>
            <li>ผักใบเขียวทุกชนิด</li>
            <li>เครื่องเทศต่างๆ เช่น กระเทียมพริกไทย</li>
            <li>ชา กาแฟ ที่ไม่ใส่น้ำตาล น้ำอัดลมที่ไม่มีน้ำตาล (แต่ไม่ควรเกิน 2 แก้วต่อวัน)</li>
            <li>เครื่องปรุง เช่น มะนาว น้ำส้มสายชู</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคเบาหวาน</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
