@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/diabetes.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3 fs-5" style="width: 900px">
        <h1>โรคเบาหวาน</h1>
        <p style="text-indent: 50px;">โรคเบาหวาน(Diabetes) คือโรคที่เกิดจากความผิดปกติของการทำงานของฮอร์โมนที่ชื่อว่า
            อินสุลิน(Insulin) ซึ่งโดยปกติแล้วร่างกายของคนเราจำเป็นต้องมีอินสุลิน เพื่อนำน้ำตาลในกระแสเลือดไปเลี้ยงอวัยวะต่าง
            ๆ
            ของร่างกาย โดยเฉพาะสมองและกล้ามเนื้อ ในภาวะที่อินสุลินมีความผิดปกติ
            ไม่ว่าจะเป็นการลดลงของปริมาณอินสุลินในร่างกาย หรือการที่อวัยวะต่าง ๆ ของร่างกายตอบสนองต่ออินสุลินลดลง
            (หรือที่เรียกว่า ภาวะดื้ออินสุลิน)
            จะทำให้ร่างกายไม่สามารถนำน้ำตาลที่อยู่ในกระแสเลือดไปใช้ได้อย่างเต็มประสิทธิภาพ
            ทำให้มีปริมาณน้ำตาลคงเหลือในกระแสเลือดมากกว่าปกติ</p>
        <h4>ข้อมูลเบื้องต้นเกี่ยวกับ โรคเบาหวาน</h4>
        <p>โรคเบาหวาน คือ ภาวะที่ร่างกายมีระดับน้ำตาลในเลือดสูงกว่าปกติ เนื่องจากการขาดฮอร์โมนอินซูลิน
            ส่งผลให้ผู้ป่วยมีอาการปากแห้ง กระหายน้ำ ปัสสาวะบ่อย อาการมือและเท้าชา ผิวแห้ง
            โดยอาการเหล่านี้อาจเกิดจากหลายสาเหตุหลายปัจจัย เช่น พันธุกรรม ภาวะอ้วน พฤติกรรมการใช้ชีวิตประจำวันอย่าง
            การขาดออกกำลังกาย รับประทานอาหารที่มีปริมาณน้ำตาลสูง เป็นต้น</p>
        <h4>สาเหตุของโรคเบาหวาน</h4>
        <p style="text-indent: 50px;">สาเหตุของโรคเบาหวานเกิดจากการที่ระดับน้ำตาลในกระแสเลือดสูงมากขึ้นถึงระดับหนึ่ง
            จนทำให้ไตดูดกลับน้ำตาลได้ไม่หมด ซึ่งปกติไตจะมีหน้าที่ดูดกลับน้ำตาลจากสารที่ถูกกรองจากหน่วยไตไปใช้
            ส่งผลให้มีน้ำตาลรั่วออกมากับปัสสาวะ จึงเป็นที่มาของคำว่า “โรคเบาหวาน” หากเราปล่อยให้เกิดภาวะเช่นนี้ไปนาน ๆ
            โดยไม่ได้รับการรักษาอย่างถูกวิธี จะทำให้เกิดภาวะแทรกซ้อนที่ร้ายแรงตามมาในที่สุด</p>
        <h4>โรคเบาหวาน ผลกระทบ การป้องกัน</h4>
        <p>หากระดับน้ำตาลในเลือดสูงเป็นระยะเวลานาน อาจส่งผลต่อระบบต่าง ๆ ภายในร่างกาย ดังนี้</p>
        <ul>
            <li>
                <h5>ระบบไหลเวียนโลหิต</h5>
                <p>ผู้ป่วย โรคเบาหวาน มักจะมีความดันโลหิตสูง ทำให้หัวใจทำงานหนัก
                    อีกทั้งผู้ป่วยเบาหวานยังมีระดับน้ำตาลในเลือดสูง ซึ่งเป็นสาเหตุที่ทำให้หลอดเลือดเปราะแตกง่าย
                    จนทำให้เกิดแผล เมื่อหลอดเลือดเกิดแผลก็จะทำให้ไขมันสะสมในหลอดเลือดมากขึ้น จนทำให้หลอดเลือดตีบและแคบลง
                    จนระบบไหลเวียนเลือดทำงานได้ไม่เต็มที่ และเพิ่มความเสี่ยงต่อการเกิดภาวะหลอดเลือดแข็ง</p>
            </li>
            <li>
                <h5>หลอดเลือด</h5>
                <p>ระดับน้ำตาลในเลือดส่วนเกินอาจทำให้หลอดเลือดมีความยืดหยุ่นน้อยลง ทำให้หลอดเลือดตีบและแคบ
                    ส่งผลให้การไหลเวียนเลือดทำได้ไม่เต็มที่ ร่างกายก็จะได้รับเลือดและออกซิเจนที่ลดลง
                    จนเพิ่มความเสี่ยงทำให้ความดันโลหิตสูง
                    ทำให้เส้นเลือดทั้งขนาดใหญ่และขนาดเล็กเกิดความเสียหายความดันโลหิตสูง
                    เป็นอีกปัจจัยหนึ่งที่ทำให้เกิดความเสี่ยงต่อการเป็นโรคหัวใจ กรมควบคุมและป้องกันโรค (CDC)
                    ได้ให้ข้อมูลว่าร้อยละ 74 ของผู้ใหญ่ที่เป็น โรคเบาหวาน มักจะมีความดันโลหิตสูงด้วย</p>
            </li>
            <li>
                <h5>ระบบหัวใจและหลอดเลือด</h5>
                <p>ข้อมูลจากกรมควบคุมและป้องกันโรค ให้ข้อมูลว่า
                    โรคหัวใจและหลอดเลือดอาจเป็นสาเหตุสำคัญของการเสียชีวิตช่วงต้นของผู้ป่วยโรคเบาหวาน นอกจากนี้
                    ผู้ป่วยโรคเบาหวานยังอาจมีแนวโน้มที่จะเป็นโรคหลอดเลือดสมองหรือเสียชีวิตด้วยโรคหัวใจบางรูปแบบมากกว่าผู้ที่ไม่เป็นโรคเบาหวานถึง
                    2-3 เท่า</p>
            </li>
            <li>
                <h5>ระบบขับถ่าย</h5>
                <p>ความเสียหายของระบบประสาทส่งผลต่อการทำงานของระบบย่อยอาหาร
                    เมื่อเส้นประสาทถูกทำลายอาจทำให้กระเพาะอาหารบีบตัวได้ช้า จนไม่สามารถย่อยอาหารได้ ทำให้เกิดอาการกรดไหลย้อน
                    คลื่นไส้ อาเจียน ท้องอืด และปวดท้อง</p>
            </li>
            <li>
                <h5>บาดแผลและการติดเชื้อ</h5>
                <p>ผู้ป่วยโรคเบาหวาน มักมีปัญหาเกี่ยวกับระบบประสาท อาจทำให้เกิดอาการเท้าชา มือชา
                    ซึ่งเสี่ยงต่อการเกิดบาดแผลและติดเชื้อได้ง่ายกว่าคนปกติทั่วไป</p>
            </li>
            <li>
                <h5>ระบบไต</h5>
                <p>ระดับน้ำตาลในเลือดที่สูงกว่าปกติ อาจทำให้ระบบไหลเวียนเลือด ที่ไปยังไตเกิดการเปลี่ยนแปลง
                    ทำให้เกิดโปรตีนในปัสสาวะในปริมาณที่สูง ส่งผลให้ไตทำงานผิดปกติซึ่งอาจทำไปสู่ภาวะไตวายได้ </p>
            </li>
            <li>
                <h5>ระบบประสาท</h5>
                <p>ภาวะแทรกซ้อนที่พบได้บ่อยในผู้ป่วยโรคเบาหวาน คือ ระบบประสาทถูกทำลาย
                    ซึ่งอาจส่งผลกระทบต่อเส้นประสาทได้หลายส่วนตั้งแต่การเคลื่อนไหว การย่อยอาหาร ไปจนถึงเพศ และระบบสืบพันธ์ุ
                    มักส่งผลให้ผู้ป่วยมีอาการชาบริเวณเท้า เหงื่อออกมากกว่าปกติ ไม่มีอารมณ์ทางเพศ</p>
            </li>
            <li>
                <h5>สายตา</h5>
                <p>ปัญหาสายตา เป็นภาวะแทรกซ้อนที่พบได้บ่อยในผู้ป่วยโรคเบาหวาน โดยเกิดจากระดับน้ำตาลในเลือดสูงเป็นระยะเวลานาน
                    ส่งผลให้หลอดเลือดเรตินาที่จอตาเกิดความเสียหาย ส่งผลให้ผู้ป่วยมีปัญหาเกี่ยวกับการมองเห็น เช่น
                    มองเห็นไม่ชัด ต้อหิน ต้อกระจก หรืออาจร้ายแรงถึงขั้นสูญเสียการมองเห็น</p>
            </li>
            <li>
                <h5>สุขภาพทางเพศ</h5>
                <p>ความเสียหายของหลอดเลือดและระบบประสาทที่เกิดจาก โรคเบาหวาน
                    อาจส่งผลเสียต่อสมรรถภาพทางเพศและการตอบสนองต่อสิ่งเร้าทางเพศ ทำให้ผู้ป่วยเบาหวานบางราย
                    มีความต้องการทางเพศต่ำ เบื่อการมีเซ็กส์และเกิดภาวะการหย่อนสมรรถภาพทางเพศ</p>
            </li>
        </ul>
        <h4>การป้องกันโรคเบาหวาน</h4>
        <p>วิธีดูแลตนเองเพื่อลดความเสี่ยงของโรคเบาหวาน มีดังนี้</p>
        <ul>
            <li>รับประทานอาหารให้ครบ 5 หมู่ เน้นรับประทานประเภทผัก ผลไม้ ธัญพืช</li>
            <li>ควบคุมน้ำหนักให้อยู่ในเกณฑ์มาตรฐาน</li>
            <li>ออกกำลังกายเป็นประจำอย่างสม่ำเสมอ อย่างน้อยวันละ 30 นาที</li>
            <li>หลีกเลี่ยงการดื่มเครื่องดื่มแอลกอฮอล์และการสูบบุหรี่</li>
            <li>ควบคุมน้ำหนักให้อยู่ในเกณฑ์ที่เหมาะสม โดยมีค่าดัชนีมวลกายระหว่าง 18.5-22.90 </li>
        </ul>
        <h4>อาหารที่ควรหลีกเลี่ยง เป็นอาหารที่ทำให้น้ำตาลในเลือดสูงขึ้นอย่างรวดเร็ว ได้แก่</h4>
        <ul>
            <li>อาหารที่มีน้ำตาลเป็นส่วนประกอบ เช่น เค้ก คุกกี้ ไอศกรีม ขนมหวาน และช็อกโกแลต</li>
            <li>เครื่องดื่มที่มีน้ำตาล เช่น น้ำหวาน น้ำอัดลม นมเปรี้ยว นมปรุงแต่งรส น้ำผลไม้ เครื่องดื่มชูกำลัง
                และน้ำเกลือแร่</li>
        </ul>
        <h4>อาหารที่รับประทานได้แต่ควรกำหนดปริมาณ</h4>
        <ul>
            <li>รับประทานอาหารที่ให้พลังงานสูง เนื้อ ไขมัน แป้ง ของหวาน</li>
            <li>อาหารประเภทโปรตีน ได้แก่ เนื้อสัตว์ต่างๆ ไข่ นม ผลิตภัณฑ์จากนม ปริมาณ 3-5 ส่วนต่อวัน</li>
            <li>อาหารไขมัน ได้แก่ ไขมันสัตว์ หนังสัตว์ติดมัน น้ำมันพืช ปริมาณ 3-5 ส่วนต่อวัน</li>
            <li>ผลไม้ นอกจากจะมีวิตามิน เกลือแร่และกากใยอาหารสูงแล้วยังมีน้ำตาลด้วยจึงต้องจำกัดปริมาณที่รับประทานไม่เกิน 3
                ส่วนต่อวัน</li>
            <li>นมและผลิตภัณฑ์ ควรดื่มนมจืดพร่องไขมัน ที่ไม่ปรุงแต่งรสวันละ 1-2 แก้ว</li>
            <li>แอลกอฮอล์ บางชนิดมีส่วนประกอบของคาร์โบไฮเดรตมาก</li>
            <li>เกลือ จะทำให้ความดันโลหิตสูง เพราะเกลือทำให้ร่างกายกักเก็บน้ำไว้มากขึ้น แนะนำรับประทานไม่เกิน 2000
                มิลลิกรัม/วัน</li>
        </ul>
        <h4>อาหารที่รับประทานได้ไม่จำกัด เป็นอาหารที่ให้พลังงานต่ำมีกากใยมาก</h4>
        <ul>
            <li>ผักใบเขียวทุกชนิด</li>
            <li>เครื่องเทศต่างๆ เช่น กระเทียมพริกไทย</li>
            <li>ชา กาแฟ ที่ไม่ใส่น้ำตาล น้ำอัดลมที่ไม่มีน้ำตาล (แต่ไม่ควรเกิน 2 แก้วต่อวัน)</li>
            <li>เครื่องปรุง เช่น มะนาว น้ำส้มสายชู</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคเบาหวาน</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
