@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/gout.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3" style="width: 900px">
        <h1>โรคเก๊าท์</h1>
        <p style="text-indent: 50px;">เป็นโรคปวดข้อเรื้อรังชนิดหนึ่งที่พบได้บ่อยโรคหนึ่ง จัดเป็นโรคของผู้ใหญ่ในวัยตั้งแต่ 40
            ปีขึ้นไป โดยอายุ 40-60 ปี จะพบโรคนี้ได้ประมาณ 2% และอายุ 60 ปีขึ้นไป จะพบได้ประมาณ 4%
            สังเกตได้ว่ายิ่งอายุมากขึ้นโอกาสที่จะเป็นโรคนี้ก็มากขึ้นตามไปด้วย มักพบได้ในผู้ชายมากกว่าผู้หญิงประมาณ 9-10
            เท่า[1] ส่วนในผู้หญิงจะพบได้น้อย หรือถ้าพบก็มักจะเป็นผู้หญิงหลังวัยหมดประจำเดือนไปแล้ว (มักเริ่มเป็นเมื่ออายุ 55
            ปีขึ้นไป) โดยทั่วไปมักเกิดกับข้อเพียงข้อเดียว ในบางครั้งอาจเกิดกับหลายข้อได้พร้อม ๆ กันก็ได้</p>
        <h4>สาเหตุโรคเก๊าท์</h4>
        <p style="text-indent: 50px;">โรคเก๊าท์เกิดจากภาวะกรดยูริก (uric acid)
            ในเลือดสูงติดต่อกันเป็นเวลานานจนเกิดเป็นผลึกสะสมอยู่ในข้อ ทำให้เกิดการอักเสบ ปวดบวมอย่างรุนแรง ทั้งนี้
            กรดยูริกเปรียบเสมือนของเสียในร่างกายที่เหลือจากการกำจัดเซลล์ที่หมดอายุลง
            โดยร่างกายของแต่ละคนจะมีกรดยูริกอยู่ประมาณร้อยละ 80 ส่วนอีกร้อยละ 20 มักได้รับจากอาหารที่รับประทานเข้าไป</p>
        <h4>อาหารที่ควรงดได้แก่</h4>
        <ul>
            <li>งดเครื่องดื่มที่มีแอลกอฮอล์เด็ดขาด เช่น เหล้า เบียร์ เพราะแอลกอฮอล์ทำให้ยูริคสูงขึ้น</li>
            <li>งดอาหารที่มีพิวรีนสูง เช่น เครื่องในสัตว์ เป็ด ไก่ กะปิ หน่อไม้ สะเดา ยอดกระถิน
                และรับประทานไขมันมากทำให้การขับถ่ายกรดยูริค เป็นไปได้ยาก</li>
        </ul>
        <h4>การควบคุมอาหารสำหรับผู้ป่วยโรคเก๊าท์</h4>
        <ul>
            <li>ไม่รับประทานอาหารมันมาก เช่น อาหารที่ทอดอมน้ำมันมาก เนื้อสัตว์ติดมัน เพราะไขมันทำให้ร่างกายขับยูริคได้น้อยลง
            </li>
            <li>ควรละเว้นไม่รับประทานส่วนยอดผัก ต้นอ่อนของผัก เช่น ยอดคะน้า ยอดผักหวาน ยอดผักบุ้งจีนหน่อไม้ หน่อไม้ฝรั่ง
                ดอกกะหล่ำ สะตอ กระถิน ชะอม ผักขม</li>
            <li>งด อาหารหมัก ที่ใช้ ยีสต์ เป็นตัวเร่งหรือส่วนประกอบ เช่น เต้าเจี้ยว</li>
            <li>เมล็ดพืชทุกชนิดที่งอกได้จะมียูริกค่อนข้างมาก แม้จะทำให้สุกแล้วก็ตาม ควรงดโดยเฉพาะขณะมีอาการ</li>
            <li>อาหารสำหรับผู้ป่วยโรคเก๊าท์</li>
            <li>รับประทานผลไม้และผักให้มาก โดย รับประทานผักส่วนที่โตเต็มวัย</li>
            <li>รับประทานอาหาร ให้ครบ 5 หมู่</li>
            <li>ดื่มน้ำสะอาด มากๆ วันละ 3 ลิตร เพื่อช่วยการขับถ่ายยูริคออกมาทางปัสสาวะ</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคอ้วน</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่ควรหลีกเลี่ยง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($inedibleFood as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
@endsection
