@extends('layouts.index')
@section('content')

    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/gout.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3" style="width: 900px">
        <h1>โรคเก๊าท์</h1>
        <p style="text-indent: 50px;">โรคเก๊าท์ คือ โรคข้ออักเสบที่เกิดการสะสมของกรดยูริกในเลือดสูง ส่งผลให้มีอาการปวด บวม แดง และอาจมีอากการเจ็บปวดอย่างเฉียบพลันหรือรุนแรงเมื่อกดข้อต่อหนึ่งข้อหรือหลายข้อ แต่ส่วนใหญ่มักเกิดขึ้นบริเวณนิ้วหัวแม่เท้า ข้อเข่า ข้อเท้า เท้า ข้อมือ และข้อศอก</p>
        <h4>อาการ โรคเก๊าท์</h4>
        <p>สัญญาณและอาการของโรคเก๊าท์มักเกิดขึ้นอย่างกะทันหัน และมักเกิดขึ้นในตอนกลางคืน โดยอาจทำให้มีอาการต่อไปนี้</p>
        <ul>
            <li>ปวดข้ออย่างเฉียบพลันและรุนแรง อาการปวดข้อต่อจะเกิดขึ้นอย่างเฉียบพลันและรุนแรงที่สุดภายใน 4-12 ชั่วโมงแรกหลังจากเริ่มมีอาการปวด</li>
            <li>รู้สึกไม่สบายบริเวณข้อต่อ เมื่อความเจ็บปวดรุนแรงค่อย ๆ บรรเทาลง อาจยังคงมีความรู้สึกไม่สบายบริเวณข้อต่ออยู่ ซึ่งอาจคงอยู่ได้ตั้งแต่ 2-3 วัน ไปจนถึง 2-3 สัปดาห์</li>
            <li>อักเสบ บวม และแดง ข้อต่อที่อักเสบจะมีอาการบวม เจ็บปวด ไวต่อความรู้สึก อุ่น และแดง</li>
            <li>ข้อต่อเคลื่อนไหวได้อย่างจำกัด ในขณะที่โรคเก๊าท์อาการเริบอาจจะไม่สามารถขยับข้อต่อได้อย่างอิสระ</li>
        </ul>
        <p>หากมีอาการปวดข้อเกิดขึ้นอย่างเฉียบพลันและรุนแรง มีไข้ อักเสบ และแสบร้อน ควรรีบเข้าพบคุณหมอเพื่อรักษาโรคเก๊าท์ รวมถึงช่วยบรรเทาอาการเจ็บและความเสียหายของข้อต่อ</p>
        <h4>ปัจจัยเสี่ยงของโรคเก๊าท์</h4>
        <p>แม้ว่าโรคเก๊าท์จะสามารถเกิดขึ้นได้กับทุกคน แต่มักพบได้บ่อยในผู้ชายและผู้หญิงวัยหมดประจำเดือน เนื่องจากร่างกายมีการสะสมกรดยูริกในเลือดได้ง่าย นอกจากนี้ ผู้ที่มีปัจจัยต่อไปนี้อาจมีแนวโน้มที่จะมีกรดยูริกในเลือดสูงได้เช่นกัน</p>
        <ul>
            <li>ครอบครัวมีประวัติเป็นโรคเก๊าท์</li>
            <li><a href="/obesity">โรคอ้วน น้ำหนักเกิน</a></li>
            <li>ภาวะหัวใจล้มเหลว</li>
            <li><a href="/diabetes">โรคเบาหวาน</a></li>
            <li><a href="/hypertension">ความดันโลหิตสูง</a></li>
            <li><a href="/kidney">โรคไต</a></li>
            <li>ผู้ที่บริโภคอาหารโปรตีนจากเนื้อสัตว์สูง</li>
            <li>ดื่มเครื่องดื่มแอลกอฮอล์มากเกินไป</li>
            <li>การใช้ยาบางชนิด เช่น ยาขับปัสสาวะ ยารักษาความดันโลหิต ยาเบต้าบล็อกเกอร์ (Beta Blockers)</li>
        </ul>
        <h4>การป้องกันโรคเก๊าท์</h4>
        <p>การปรับพฤติกรรมการใช้ชีวิตบางประการอาจช่วยป้องกันโรคเก๊าท์ได้ ดังนี้</p>
       <ul>
        <li>การดื่มน้ำให้มากขึ้น โดยควรดื่มน้ำให้เพียงพออย่างน้อย 2-3 ลิตร/วัน เพื่อช่วยให้ไตทำงานได้ดีขึ้นและป้องกันภาวะร่างกายขาดน้ำ</li>
        <li>ออกกำลังกายอย่างสม่ำเสมอ เพื่อป้องกันการเพิ่มของน้ำหนักและโรคอ้วน ที่อาจเป็นปัจจัยเสี่ยงในการเพิ่มกรดยูริกในร่างกาย ซึ่งส่งผลให้ข้อต่อเกิดการอักเสบ</li>
        <li>หลีกเลี่ยงการรับประทานอาหารบางชนิดที่อาจเพิ่มปริมาณสารพิวรีน (Purine) ในร่างกาย เช่น เครื่องดื่มแอลกอฮอล์ เนื้อแดง เครื่องใน หอย เครื่องดื่มและอาหารที่มีฟรุกโตสสูง โปรตีนจากสัตว์ เนื่องจากสารเคมีชนิดนี้อาจกระตุ้นการสร้างกรดยูริกในร่างกายให้มากขึ้น</li>
        <li>หลีกเลี่ยงยาบางชนิดที่ทำให้ระดับกรดยูริกในร่างกายสูงขึ้น เช่น ยาขับปัสสาวะ สารก่อภูมิแพ้ ยากดภูมิคุ้มกัน</li>
       </ul>
       <h4>การดูแลด้านอาการ</h4>
        <h5>อาหารที่ควรงดได้แก่</h5>
        <ul>
            <li>งดเครื่องดื่มที่มีแอลกอฮอล์เด็ดขาด เช่น เหล้า เบียร์ เพราะแอลกอฮอล์ทำให้ยูริคสูงขึ้น</li>
            <li>งดอาหารที่มีพิวรีนสูง เช่น เครื่องในสัตว์ เป็ด ไก่ กะปิ หน่อไม้ สะเดา ยอดกระถิน
                และรับประทานไขมันมากทำให้การขับถ่ายกรดยูริค เป็นไปได้ยาก</li>
        </ul>
        <h5>การควบคุมอาหารสำหรับผู้ป่วยโรคเก๊าท์</h5>
        <ul>
            <li>ไม่รับประทานอาหารมันมาก เช่น อาหารที่ทอดอมน้ำมันมาก เนื้อสัตว์ติดมัน เพราะไขมันทำให้ร่างกายขับยูริคได้น้อยลง
            </li>
            <li>ควรละเว้นไม่รับประทานส่วนยอดผัก ต้นอ่อนของผัก เช่น ยอดคะน้า ยอดผักหวาน ยอดผักบุ้งจีนหน่อไม้ หน่อไม้ฝรั่ง
                ดอกกะหล่ำ สะตอ กระถิน ชะอม ผักขม</li>
            <li>งด อาหารหมัก ที่ใช้ ยีสต์ เป็นตัวเร่งหรือส่วนประกอบ เช่น เต้าเจี้ยว</li>
            <li>เมล็ดพืชทุกชนิดที่งอกได้จะมียูริกค่อนข้างมาก แม้จะทำให้สุกแล้วก็ตาม ควรงดโดยเฉพาะขณะมีอาการ</li>
            <li>อาหารสำหรับผู้ป่วยโรคเก๊าท์</li>
            <li>รับประทานผลไม้และผักให้มาก โดย รับประทานผักส่วนที่โตเต็มวัย</li>
            <li>รับประทานอาหาร ให้ครบ 5 หมู่</li>
            <li>ดื่มน้ำสะอาด มากๆ วันละ 3 ลิตร เพื่อช่วยการขับถ่ายยูริคออกมาทางปัสสาวะ</li>
        </ul>
        <hr>
    </div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่สามารถรับประทานได้</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($foods as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่ควรหลีกเลี่ยง</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($inedibleFood as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
@endsection
