@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคหัวใจขาดเลือด</h1>
        <p style="text-indent: 50px;">โรคหัวใจขาดเลือด (Ischemic Heart Disease) หรือโรคหลอดเลือดหัวใจ
            เป็นภาวะที่หัวใจขาดออกซิเจน เนื่องจากมีเลือดไหลไปหล่อเลี้ยงไม่เพียงพอ
            ส่งผลให้เสี่ยงที่จะหัวใจวายหรือเสียชีวิตได้
            ศูนย์ควบคุมและป้องกันโรคแห่งสหรัฐอเมริกา รายงานว่า โรคหัวใจขาดเลือดเป็นโรคหัวใจและหลอดเลือดที่พบได้บ่อยที่สุด
            และในปี พ.ศ. 2563 ชาวอเมริกันเสียชีวิตจากโรคหัวใจขาดเลือดจำนวน 382,820 ราย</p>
        <h4>อาการ</h4>
        <p>เมื่อเป็นโรคหัวใจขาดเลือด จะรู้สึกแน่นหน้าอก บริเวณด้านซ้ายของหน้าอก
            โดยอาการมักเกิดขึ้นตอนกลางคืนหรือหลังจากออกกำลังกายหรือมีอารมณ์รุนแรง เช่น โกรธ เครียด
            โดยทั่วไป อาการแน่นหน้าอกจะหายเองได้ภายในไม่กี่นาที แต่บางรายโดยเฉพาะผู้หญิง อาจมีอาการเจ็บบริเวณคอ แขน หรือหลัง
            ร่วมด้วย ทั้งนี้ อาการอื่น ๆ ของโรคหัวใจขาดเลือด ได้แก่</p>
        <ul>
            <li>หายใจไม่ออก</li>
            <li>ใจสั่น</li>
            <li>อ่อนเพลีย</li>
            <li>เหงื่อออก</li>
        </ul>
        <h4>สาเหตุของโรคหัวใจขาดเลือด</h4>
        <p>โรคหัวใจขาดเลือดมีสาเหตุมาจากภาวะหลอดเลือดแข็ง หรือเนื่องจากไขมัน คอเลสเตอรอล หรือสสารต่าง ๆ เข้าไปสะสมในเลือด
            แล้วทำให้หลอดเลือดแคบลงหรืออุดตัน จนระบบหมุนเวียนเลือดมีปัญหาและไม่สามารถส่งเลือดไปหล่อเลี้ยงหัวใจได้</p>
        <p>โดยทั่วไป โรคหัวใจขาดเลือด รวมถึงภาวะหลอดเลือดแข็ง มักเกิดกับกลุ่มเสี่ยงดังต่อไปนี้</p>
        <ul>
            <li>ผู้สูงอายุ</li>
            <li>ผู้ที่สูบบุหรี่</li>
            <li><a href="/hypertension">ผู้ที่มีความดันโลหิตสูง</a></li>
            <li>ผู้ที่มีน้ำหนักเกิน เป็น<a href="/obesity">โรคอ้วน ไม่ชอบเคลื่อนไหวร่างกาย</a></li>
            <li><a href="/diabetes">ผู้ป่วยโรคเบาหวาน</a></li>
            <li><a href="/kidney">ผู้ป่วยโรคไตเรื้อรัง</a></li>
            <li>ผู้ที่มีคอเลสเตอรอลสูง</li>
            <li>ผู้ที่รับประทานอาหารซึ่งอุดมไปด้วยไขมัน เกลือ น้ำตาล</li>
            <li>ผู้ที่นอนหลับไม่เพียงพอ</li>
            <li>ผู้ที่ดื่มเครื่องดื่มแอลกอฮอล์ในปริมาณมาก</li>
            <li>ผู้ที่มีสารโฮโมซิสเทอีน (Homocysteine) ในร่างกายสูง</li>
        </ul>
        <h4>การรักษา โรคหัวใจขาดเลือด</h4>
        <p>ปกติแล้ว คุณหมอจะรักษาโรคหัวใจขาดเลือด ด้วยการจ่ายยาดังต่อไปนี้</p>
        <ul>
            <li>ยาลดคอเลสเตอรอล เช่น ยากลุ่มสแตติน (Statin) อย่างอะโทวาสแตติน (Atorvastatin) หรือโรสุวาสแตติน (Rosuvastatin)
            </li>
            <li>ยาลดความดันโลหิต เช่น ยากลุ่มเบตา บล็อกเกอร์ (Beta Blocker)
                ซึ่งออกฤทธิ์ลดยับยั้งการทำงานของฮอร์โมนเอดริแนฟรีน (Adrenaline) ทำให้อัตราการเต้นของหัวใจและความดันโลหิตลดลง
                ทั้งนี้ หากยากลุ่มเบตา บล็อกเกอร์ใช้ไม่ได้ผล คุณหมอจะจ่ายยาแคลเซียม แชนแนล บล็อกเกอร์ (Calcium Channel
                Blocker) ให้รับประทานแทน</li>
            <li>ยาบรรเทาอาการเจ็บหน้าอก เช่น ยาไนเตรต (Nitrate) ซึ่งมีฤทธิ์ผ่อนคลายหลอดเลือด
                ทำให้ความดันโลหิตลดลงและอาการเจ็บหน้าอกดีขึ้นในเวลาเดียวกัน</li>
            <li>ยาต้านการแข็งตัวของเลือด เช่น แอสไพริน (Aspirin) โคลพิโดเกรล (Clopidogrel) ไรวาร็อกซาแบน (Rivaroxaban)</li>
        </ul>
        <h4>การดูแลด้านอาการ</h4>
        <h5>อาหารที่รับประทานได้</h5>
        <ul>
            <li>เนื้อสัตว์ที่ไม่ติดมันและหนัง</li>
            <li>ปลาทะเล เช่น ปลาทู ปลาทูน่า ปลาแซลมอน ปลาซาดีน
                แนะนำให้รับประทานอย่างน้อยสัปดาห์ละ 2 ครั้ง เพราะน้ำมันจากปลาทะเลช่วยลดระดับไตรกลีเซอไรด์
                ในเลือดและช่วยป้องกันการเกิดโรคหัวใจได้
            </li>
            <li>น้ำมันจากพืช ควรใช้ปริมาณที่น้อยๆ เช่น น้ำมันถั่วเหลือง น้ำมันดอกทานตะวัน น้ำมันงา น้ำมันดอกคำฝอย
                น้ำมันมะกอก น้ำมันคาโนลา น้ำมันถั่วลิสง เป็นต้น</li>
        </ul>
        <h5>อาหารที่ควรหลีกเลี่ยง</h5>
        <ul>
            <li>อาหารที่มีคอลเรสเตอรอลสูง เช่น ไข่แดง มันหมู มันไก่ อาหารทะเล ยกเว้นเนื้อปลา น้ำมันจากพืชบางชนิด เช่น
                น้ำมันปาล์ม น้ำมันมะพร้าว กะทิ บรรดาของทอด หรือผลิตภัณฑ์จากนม เช่น เนย มาการีน ชีส </li>
            <li>อาหารที่มีไขมันชนิดอิ่มตัว (รับประทานได้ไม่เกิน 10% หรือน้อยกว่าจากพลังงานที่ควรได้รับตลอดวัน) เช่น
                ผลิตภัณฑ์จากเนื้อสัตว์ อาหารที่มีส่วนประกอบของไขมันสัตว์ (เช่น ไส้กรอก กุนเชียง หมูยอ)
            </li>
            <li>อาหารที่มีไขมันทรานส์ ซึ่งเป็นไขมันที่ผ่านกระบวนการเติมไฮโดรเจน ทำให้คุณสมบัติของไขมันเปลี่ยนแปลงไป
                มักพบในครีมเทียม เนยเทียม เนยขาว ขนมกรุบกรอบ คุกกี้ เค้ก และอาหารทอดที่ใช้น้ำมันทอดซ้ำ</li>
            <li>ไขมันชนิดโอเมก้า 3 อยู่มาก ช่วยลดระดับไตรกลีเซอไรด์ในเลือดได้ดี อย่างน้อยสัปดาห์ละ 3-4 ครั้ง </li>
            <li>เลือกรับประทานนมชนิดไขมันต่ำ (นมพร่องมันเนย) แทนนมสดครบส่วน </li>
            <li>เลือกรับประทานไอศกรีมไขมันต่ำหรือเชอเบท แทนไอศกรีมกะทิและไอศกรีมที่ทำจากนมและครีม</li>
        </ul>
        <hr>
    </div>
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคไขมันในเลือดสูง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">แก้วมังกร</p>
                                <i class="fa-solid fa-fire"> 100 kcal</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
@endsection
