@extends('layouts.index')
@section('content')
    https://hellokhunmor.com/%e0%b8%aa%e0%b8%b8%e0%b8%82%e0%b8%a0%e0%b8%b2%e0%b8%9e%e0%b8%ab%e0%b8%b1%e0%b8%a7%e0%b9%83%e0%b8%88/%e0%b9%82%e0%b8%a3%e0%b8%84%e0%b8%ab%e0%b8%a5%e0%b8%ad%e0%b8%94%e0%b9%80%e0%b8%a5%e0%b8%b7%e0%b8%ad%e0%b8%94%e0%b8%ab%e0%b8%b1%e0%b8%a7%e0%b9%83%e0%b8%88/%e0%b9%82%e0%b8%a3%e0%b8%84%e0%b8%ab%e0%b8%b1%e0%b8%a7%e0%b9%83%e0%b8%88%e0%b8%82%e0%b8%b2%e0%b8%94%e0%b9%80%e0%b8%a5%e0%b8%b7%e0%b8%ad%e0%b8%94-%e0%b8%aa%e0%b8%b2%e0%b9%80%e0%b8%ab%e0%b8%95%e0%b8%b8-%e0%b8%ad%e0%b8%b2%e0%b8%81%e0%b8%b2%e0%b8%a3-%e0%b9%81%e0%b8%a5%e0%b8%b0%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b8%a3%e0%b8%b1%e0%b8%81%e0%b8%a9%e0%b8%b2/
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคหัวใจขาดเลือด</h1>
        <p style="text-indent: 50px;">โรคที่เกิดขึ้นเนื่องจากหลอดเลือดเลี้ยงหัวใจตีบหรือตัน
            ทำให้กล้ามเนื้อหัวใจมีเลือดไปเลี้ยงลดลงหรือไม่มีเลย เป็นผลให้การทำงานของกล้ามเนื้อหัวใจผิดปกติ
            หากรุนแรงทำให้เกิดกล้ามเนื้อหัวใจตายได้ การที่หลอดเลือดเลี้ยงหัวใจตีบหรือตันนั้น
            ส่วนใหญ่แล้วเกิดจากหลอดเลือดแข็งตัวขึ้น เนื่องจากมีไขมันสะสมในผนังด้านในของหลอดเลือด
            เป็นผลให้ทางที่เลือดไหลผ่านแคบลง เลือดไหลไม่สะดวก กล้ามเนื้อหัวใจจึงได้รับเลือดน้อยกว่าปกติ
            นอกจากนั้นยังอาจเกิดจากเกร็ดเลือดและลิ่มเลือดอุดตันอีกด้วย</h4>
        <h4>สาเหตุของโรคหัวใจขาดเลือด</h4>
        <p>สาเหตุของโรคหัวใจขาดเลือด มักจะเกิดจากปัจจัยเสี่ยงหลายอย่าง
            ผู้ที่มีปัจจัยเสี่ยงหลายข้อก็จะมีโอกาสเกิดโรคหัวใจขาดเลือดได้มากกว่าผู้อื่น และมักมีความรุนแรง
            ของโรคมากกว่าผู้ที่ไม่มีปัจจัยเสี่ยง</p>
        <h4>อาหารที่รับประทานได้</h4>
        <ul>
            <li>เนื้อสัตว์ที่ไม่ติดมันและหนัง</li>
            <li>ปลาทะเล เช่น ปลาทู ปลาทูน่า ปลาแซลมอน ปลาซาดีน
                แนะนำให้รับประทานอย่างน้อยสัปดาห์ละ 2 ครั้ง เพราะน้ำมันจากปลาทะเลช่วยลดระดับไตรกลีเซอไรด์
                ในเลือดและช่วยป้องกันการเกิดโรคหัวใจได้
            </li>
            <li>น้ำมันจากพืช ควรใช้ปริมาณที่น้อยๆ เช่น น้ำมันถั่วเหลือง น้ำมันดอกทานตะวัน น้ำมันงา น้ำมันดอกคำฝอย
                น้ำมันมะกอก น้ำมันคาโนลา น้ำมันถั่วลิสง เป็นต้น</li>
        </ul>
        <h4>อาหารที่ควรหลีกเลี่ยง</h4>
        <ul>
            <li>อาหารที่มีคอลเรสเตอรอลสูง เช่น ไข่แดง มันหมู มันไก่ อาหารทะเล ยกเว้นเนื้อปลา น้ำมันจากพืชบางชนิด เช่น
                น้ำมันปาล์ม น้ำมันมะพร้าว กะทิ บรรดาของทอด หรือผลิตภัณฑ์จากนม เช่น เนย มาการีน ชีส </li>
            <li>อาหารที่มีไขมันชนิดอิ่มตัว (รับประทานได้ไม่เกิน 10% หรือน้อยกว่าจากพลังงานที่ควรได้รับตลอดวัน) เช่น
                ผลิตภัณฑ์จากเนื้อสัตว์ อาหารที่มีส่วนประกอบของไขมันสัตว์ (เช่น ไส้กรอก กุนเชียง หมูยอ)
            </li>
            <li>อาหารที่มีไขมันทรานส์ ซึ่งเป็นไขมันที่ผ่านกระบวนการเติมไฮโดรเจน ทำให้คุณสมบัติของไขมันเปลี่ยนแปลงไป
                มักพบในครีมเทียม เนยเทียม เนยขาว ขนมกรุบกรอบ คุกกี้ เค้ก และอาหารทอดที่ใช้น้ำมันทอดซ้ำ</li>
            <li>ไขมันชนิดโอเมก้า 3 อยู่มาก ช่วยลดระดับไตรกลีเซอไรด์ในเลือดได้ดี อย่างน้อยสัปดาห์ละ 3-4 ครั้ง </li>
            <li>เลือกรับประทานนมชนิดไขมันต่ำ (นมพร่องมันเนย) แทนนมสดครบส่วน </li>
            <li>เลือกรับประทานไอศกรีมไขมันต่ำหรือเชอเบท แทนไอศกรีมกะทิและไอศกรีมที่ทำจากนมและครีม</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคอ้วน</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่ควรหลีกเลี่ยง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($inedibleFood as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
@endsection
