@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคความดันโลหิตสูง</h1>
        <p style="text-indent: 50px;">โรคความดันโลหิตสูง เป็นภาวะที่ร่างกายมีความดันเลือดสูง
            เกิดขึ้นเมื่อความดันโลหิตของคุณมีค่าสูงติดต่อกันเป็นเวลานาน
            โดยปัจจัยหลักของโรคความดันโลหิตสูงส่วนใหญ่มักมาจากรูปแบบการใช้ชีวิตประจำวัน ตั้งแต่การดื่มเครื่องดื่มแอลกอฮอล์
            การสูบบุหรี่ การรับประทานอาหารที่ก่อให้เกิดความเสี่ยง
            พฤติกรรมเหล่านี้เป็นปัจจัยหลักที่นำไปสู่ความเสี่ยงของโรคดังกล่าวได้
            ยิ่งไปกว่านั้นผู้ป่วยที่เป็นโรคเรื้อรังอื่น ๆ เช่น โรคอ้วน และโรคเบาหวาน
            ก็มีความเสี่ยงที่จะเป็นโรคความดันโลหิตสูงได้เช่นเดียวกัน
            ทั้งนี้โรคความดันโลหิตสูงยังได้รับการจัดว่าเป็นโรคทางพันธุกรรม ดังนั้น
            หากคุณมีสมาชิกในครอบครัวที่เป็นโรคความดันโลหิตสูง หรือโรคความดันโลหิตสูงเรื้อรังแต่เดิม
            ก็สามารถนำพาส่งต่อมาทางยีนส์สู่คุณ หรือบุตรหลานสืบเนื่องต่อ ๆ กันไป</p>
        <h4>ความดันโลหิตสูง</h4>
        <p style="text-indent: 50px;">ความดันโลหิตในอัตราที่เหมาะสมของคนเรานั้น ควรอยู่ระหว่าง 90/60 มม. ปรอท และ 120/80 มม.
            ปรอท หากความดันโลหิตมีค่าถึง 140/90 มม. ปรอท หรือสูงไปกว่านี้ ก็อาจหมายความได้ว่าคุณกำลังมีภาวะ ความดันโลหิตสูง
            นั่นเอง แต่ในความเป็นจริงแล้ว ค่าความดันโลหิตมักไม่มีตัวเลขคงที่เสมอไป เพราะมักมีการเปลี่ยนแปลงค่าตลอดเวลา
            โดยขึ้นอยู่กับสภาพอารมณ์ กิจกรรมที่ทำเป็นประจำ และแม้กระทั่งอาหา หรือเครื่องดื่มที่รับประทานในแต่ละมื้อ
            อีกทั้งความดันโลหิตของคุณอาจเพิ่มสูงขึ้นหลังจากการออกกำลังกาย เช่น การวิ่ง การเดินในระยะไกล หรือการปีนขั้นบันได
            หรือกำลังตกอยู่ในสถานการณ์บางอย่างที่กระทบกระเทือนจิตใจ และมีอัตราของค่าความดันเพียงระยะสั้น ๆ ชั่วคราว
            อย่างไรก็ตามการมีภาวะความดันโลหิตสูงนาน ๆ ครั้ง มักไม่ได้หมายความว่าคุณจะเป็นโรคความดันโลหิตสูงเรื้อรังเสมอไป
            เพื่อให้ทราบผลลัพธ์ที่แน่ชัด และแม่นยำ
            คุณอาจต้องเข้าขอรับการตรวจสุขภาพร่างกายอย่างสม่ำเสมอร่วมด้วยตามการนัดหมายแพทย์</p>
        <h4>รู้ให้ทันก่อนเสี่ยงเป็น ความดันโลหิต และ โรคความดันโลหิตสูง</h4>
        <p style="text-indent: 50px;">ค่าความดันโลหิตระหว่าง 120/80 มม. ปรอท และ 140/90 มม. ปรอท
            เป็นสัญญาณเตือนสำหรับความดันโลหิตสูง หากคุณไม่เข้ารับการตรวจวัด เพื่อรับคำแนะนำจากแพทย์ในการลดความดันโลหิต
            ก็อาจส่งผลให้คุณสามารถเสี่ยงเป็นโรคความดันโลหิตสูงเรื้อรังจนทำลายสุขภาพ และยากต่อการรักษามากกว่าเดิมได้ </p>
        <ul>
            <li>งดสูบบุหรี่หรือดื่มเครื่องดื่มแอลกอฮอล์</li>
            <li>พยายามจำกัดการบริโภคคาเฟอีน และเกลือ</li>
            <li>หากคุณเป็นโรคเรื้อรังอื่น ๆ ให้เข้ารับการรักษาหรือคำปรึกษาจากแพทย์ผู้เชี่ยวชาญ</li>
            <li>ผู้ที่มีค่าความดันเลือดสูงอย่างต่อเนื่อง
                อาจจำเป็นต้องใช้ยาเพื่อควบคุมระดับความดันโลหิตไม่ให้มีค่าสูงจนเกินกว่าเกณฑ์</li>
        </ul>
        <h4>การดูแลด้านอาการ</h4>
        <h5>เป็นความดันสูงห้ามกินอะไรบ้าง</h5>
        <ul>
            <li>อาหารที่มีน้ำตาลเป็นส่วนประกอบ เช่น เค้ก คุกกี้ ไอศกรีม ขนมหวาน และช็อกโกแลต</li>
            <li>เครื่องดื่มที่มีน้ำตาล เช่น น้ำหวาน น้ำอัดลม นมเปรี้ยว นมปรุงแต่งรส น้ำผลไม้ เครื่องดื่มชูกำลัง
                และน้ำเกลือแร่</li>
        </ul>
        <h5>อาหารที่รับประทานได้แต่ควรกำหนดปริมาณ</h5>
        <ul>
            <li>อาหารโซเดียมสูง เช่น อาหารเค็ม อาหารรสจัด อาหารแปรรูป เครื่องปรุง ฯลฯ เนื่องจากการได้รับโซเดียมเกิน</li>
            <li>อาหารไขมันสูง เช่น อาหารมัน อาหารทอด เบเกอรี่บางชนิด ฯลฯ เนื่องจากการได้รับไขมันมากเกินไป</li>
            <li>อาหารน้ำตาลสูง เช่น ขนมหวาน น้ำหวาน น้ำอัดลม ฯลฯ เนื่องจากการได้รับน้ำตาลเกินพอดี</li>
            <li>เครื่องดื่มแอลกอฮอล์ เช่น เหล้า เบียร์ ไวน์ ฯลฯ เนื่องจากการได้รับแอลกอฮอล์มากเกินไป</li>
            <li>เครื่องดื่มที่มีคาเฟอีน เช่น ชา กาแฟ เครื่องดื่มชูกำลัง น้ำอัดลม ฯลฯ เนื่องจากคาเฟอีนนั้นหากได้รับมากเกินไป
            </li>
        </ul>
        <h5>สามารถกินเพื่อลดความดัน</h5>
        <ul>
            <li>ข้าว แป้ง ธัญพืช 6-8 ส่วนต่อวัน (ประมาณ 6-8 ทัพพี) เน้นเป็นประเภทไม่ขัดสี เช่น ข้าวกล้อง ข้าวหอมนิล ข้าวไรซ์
                ฯลฯ</li>
            <li>ผัก 4-5 ส่วนต่อวัน (ประมาณ 4-5 ทัพพี) โดยเน้นให้มีความหลากหลาย</li>
            <li>ผลไม้ 4-5 ส่วนต่อวัน (ประมาณ 4-5 จานรองกาแฟ) โดยเน้นให้มีความหลากหลาย</li>
            <li>เนื้อสัตว์ 6 ส่วนต่อวัน (ประมาณ 12 ช้อนกินข้าว) เน้นเป็นเนื้อสัตว์ที่มีไขมันต่ำ เช่น ปลา อกไก่ไม่ติดหนัง
                สันในหมู ไข่ขาว ฯลฯ</li>
            <li>นมวัวและผลิตภัณฑ์จากนมวัว 2-3 ส่วนต่อวัน (ประมาณ 2-3 แก้ว) เน้นเป็นสูตรไขมันต่ำ เช่น นมพร่องมันเนย ฯลฯ</li>
            <li>ถั่วและเมล็ด 4-5 ส่วนต่อสัปดาห์ (ประมาณ 4-5 กำมือ) เช่น ถั่วลิสง อัลมอนด์ เม็ดมะม่วงหิมพานต์ เมล็ดทานตะวัน
                ฯลฯ</li>
            <li>ไขมัน 2-3 ส่วนต่อวัน (ไขมัน 1 ส่วน ก็อย่างเช่น น้ำมัน 1 ช้อนชา มายองเนส 1 ช้อนโต๊ะ น้ำสลัด 2 ช้อนโต๊ะ
                เป็นต้น) โดยเน้นเป็นไขมันจากพืช</li>
            <li>น้ำตาลและของหวาน ไม่เกิน 5 ส่วนต่อสัปดาห์ (น้ำตาลและของหวาน 1 ส่วน ก็อย่างเช่น น้ำตาล 1 ช้อนโต๊ะ แยม 1
                ช้อนโต๊ะ น้ำหวาน 0.5-1 แก้ว เป็นต้น)</li>
            <li>โซเดียม ไม่เกิน 2,300 มิลลิกรัมต่อวัน หรืออาจปรับเป็นไม่เกิน 1,500 มิลลิกรัมต่อวันแทน
                เพื่อให้ได้ผลการลดความดันที่ดียิ่งขึ้น</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคความดันโลหิตสูง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
