@extends('layouts.index')
@section('content')

    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/hyperlipidemia.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคไขมันในเลือดสูง</h1>
        <p style="text-indent: 50px;">โรคไขมันในเลือดสูง คือภาวะที่ระดับไขมันในเลือดสูงจนอาจเป็นอันตรายต่อร่างกาย
            โดยไขมันชนิดหลักที่พบในเลือดมี 2 ชนิด ได้แก่ ไตรกลีเซอไรด์ (Triglycerides) และคอเลสเตอรอล (Cholesterol)
            ซึ่งมีความสำคัญต่อระบบการทำงานของร่างกาย แต่หากมีปริมาณสูงเกินไปอาจเสี่ยงต่อการเกิดโรคหัวใจและโรคหลอดเลือดสมอง
            ไตรกลีเซอไรด์ได้มาจากร่างกายสร้างขึ้นเองหรือได้รับจากอาหารที่รับประทานเข้าไปโดยตรง
            อย่างเนื้อแดงหรือผลิตภัณฑ์นมที่มีไขมัน นอกจากนี้ ผลิตภัณฑ์ประเภทน้ำตาลทราย น้ำตาลฟรักโทส
            และแอลกอฮอล์ก็มีส่วนเพิ่มปริมาณไตรกลีเซอไรด์ในร่างกายได้เช่นกัน สำหรับคอเลสเตอรอลมีความจำเป็นต่อเซลล์ต่าง ๆ
            ในร่างกาย โดยเป็นไขมันที่ร่างกายสามารถสังเคราะห์ขึ้นเองจากตับและสามารถพบได้ในอาหาร เช่น ไข่ สัตว์เนื้อแดง
            โดยเฉพาะเครื่องในสัตว์ หนังสัตว์ และชีส เป็นต้น </p>
        <p>ด้วยคุณสมบัติที่ไม่ละลายในน้ำของไขมัน จึงต้องรวมตัวกับโปรตีนในตับจนเกิดเป็น ไลโปโปรตีน (Lipoprotein)
            เพื่อให้สามารถลำเลียงในเลือดได้ ซึ่งไลโปโปรตีนในร่างกายมี 3 ชนิด ได้แก่ </p>
        <ul>
            <li>คอเลสเตอรรอลชนิดไม่ดี</li>
            <li>คอเลสเตอรรอลชนิดดี</li>
            <li>วีแอลดีแอล</li>
        </ul>
        <p>ไขมันในเลือดสูงเป็นที่รู้จักกันในอีกชื่อหนึ่งว่า คอเลสเตอรรอลสูง
            แต่หากใช้คำว่าไขมันในเลือดสูงนั้นจะมีความหมายที่ครอบคลุมมากกว่าคอเลสเตอรรอลสูง
            เนื่องจากเป็นการเรียกรวมถึงไขมันทั้งคอเลสเตอรอลและไตรกลีเซอร์ไรด์ด้วย</p>
        <h4>อาการของไขมันในเลือดสูง</h4>
        <p style="text-indent: 50px;">ในระยะแรก คนส่วนมากมักไม่ทราบว่าตนเองมีระดับไขมันในเลือดสูง เพราะไม่มีอาการแสดงให้เห็น
            แต่หากในร่างกายมีคอเลสเตอรอลและไตรกลีเซอไรด์มากเกินไปเป็นระยะเวลานาน ต่อมาอาจเกิดการสะสมของไขมันในหลอดเลือดแดง
            ทำให้หลอดเลือดตีบแคบลงและเลือดไหลเวียนได้ลำบาก ส่งผลให้ผู้ป่วยอาจมีความดันโลหิตสูงขึ้น นอกจากนี้
            การสะสมของไขมันในหลอดเลือดอาจทำให้เกิดเป็นลิ่มเลือดอุดตันที่หัวใจ และอาจนำไปสู่ภาวะหัวใจขาดเลือด
            หรือหากเกิดขึ้นบริเวณสมองก็อาจนำไปสู่โรคหลอดเลือดสมอง</p>
        <h4>สาเหตุของภาวะไขมันในเลือดสูง</h4>
        <p>ไขมันในเลือดสูงเกิดได้จากหลายปัจจัย ดังนี้</p>
        <h5>พฤติกรรมการใช้ชีวิต</h5>
        <p style="text-indent: 50px;">
            การมีพฤติกรรมการใช้ชีวิตที่ส่งผลเสียต่อสุขภาพเป็นสาเหตุหลักที่เพิ่มโอกาสในการเกิดไขมันในเลือดสูง
            โดยเฉพาะการรับประทานอาหารที่มีคอเลสเตอรอล ไขมันอิ่มตัว ไขมันทรานส์ หรือคารโบไฮเดรตสูงเกินไป เช่น อาหารประเภทชีส
            ไข่แดง อาหารประเภททอดหรือผ่านกระบวนการแปรรูป ไอศกรีม ขนมอบ เนื้อแดง เป็นต้น นอกจากนี้
            การออกกำลังกายอย่างสม่ำเสมอหรือเคลื่อนไหวร่างกายน้อย
            รวมทั้งการสูบบุหรี่หรือดื่มเครื่องดื่มแอลกอฮอล์มากเกินไปก็สามารถนำไปสู่ไขมันในเลือดสูงได้เช่นกัน</p>
        <h5>ปัจจัยเสี่ยงอื่น ๆ</h5>
        <p>นอกเหนือจากพฤติกรรมการใช้ชีวิต ยังพบปัจจัยเสี่ยงที่ทำให้เกิดไขมันในเลือดได้มากขึ้น ได้แก่</p>
        <ul>
            <li>อายุ โดยระดับของคอเลสเตอรอลมักเพิ่มขึ้นเมื่อมีอายุมากขึ้น</li>
            <li>กรรมพันธ์ุ โรคไขมันในเลือดสูงอาจมาจากการถ่ายทอดทางพันธุกรรม (Familial Hypercholesterolemia)
                ส่งผลให้บุคคลนั้นมีความผิดปกติในการเผาผลาญไขมัน
                ซึ่งอาจนำไปสู่โรคหลอดเลือดแดงแข็งหรือเสี่ยงต่อการเกิดโรคหัวใจได้แม้ผู้ป่วยจะมีอายุน้อย</li>
            <li>มีปัญหาสุขภาพอื่น ๆ เช่น โรคเบาหวาน โรคไต ภาวะขาดไทรอยด์ (Underactive Thyroid) ภาวะน้ำหนักเกินหรือโรคอ้วน
                กลุ่มอาการถุงน้ำจำนวนมากในรังไข่ (Polycystic Ovary Syndrome) เป็นต้น</li>
        </ul>
        <h4>การรักษาไขมันในเลือดสูง</h4>
        <p>เป้าหมายของการรักษาคือการลดระดับคอเลสเตอรอลลงอย่างมีประสิทธิภาพ
            โดยอาจให้ผู้ป่วยปรับเปลี่ยนพฤติกรรมการใช้ชีวิตหรือดูแลเรื่องการรับประทานอาหารให้ดีขึ้น
            แต่บางรายอาจต้องใช้ยาควบคู่กันไปด้วย</p>
        <h4>การรักษาโดยการปรับพฤติกรรม</h4>
        <p>การปรับพฤติกรรมการใช้ชีวิตถือเป็นส่วนสำคัญในการรักษาโรค
            เนื่องจากเป็นปัจจัยสำคัญหนึ่งที่จะช่วยลดความเสี่ยงต่อการเกิดอาการแทรกซ้อน โดยเฉพาะโรคหัวใจหรือโรคหลอดเลือดสมอง
            หากผู้ป่วยได้รับยาในการรักษาอยู่แล้ว การปรับพฤติกรรมจะช่วยเพิ่มประสิทธิภาพของยาในการลดคอเลสเตอรอลได้
            ซึ่งสามารถทำได้ ดังนี้</p>
        <ul>
            <li>รับประทานอาหารที่มีประโยชน์และไฟเบอร์สูง เช่น ผักและผลไม้ ธัญพืชไม่ขัดสี ปลา ถั่ว เป็นต้น
                รวมไปให้หลีกเลี่ยงการรับประทานไขมันอิ่มตัวและไขมันทรานส์ อย่างเนื้อแดง ผลิตภัณฑ์นมที่มีไขมัน ของทอด
                และอาหารแปรรูปต่าง ๆ แต่ควรเลือกอาหารที่มีไขมันชนิดไม่อิ่มตัว ไขมันต่ำหรือไม่มีไขมันทดแทน </li>
            <li>ออกกำลังกายเป็นประจำอย่างน้อยสัปดาห์ละ 150 นาที หรือออกกำลังที่หนักปานกลางถึงหนักมากอย่างน้อยสัปดาห์ละ 5
                ครั้ง ครั้งละ 30 นาที โดยผู้ป่วยควรขอคำแนะนำจากแพทย์หรืออยู่ในดุลยพินิจของแพทย์</li>
            <li>เคลื่อนไหวร่างกายให้มากขึ้นเพื่อเพิ่มการเผาผลาญพลังงาน โดยอาจใช้การเดินขึ้น-ลงบันไดแทนการใช้ลิฟท์
                เดินในระยะใกล้ ๆ แทนการนั่งรถ</li>
            <li>ลดน้ำหนักให้อยู่ในเกณฑ์ที่เหมาะสม</li>
            <li>หลีกเลี่ยงการสูบบุหรี่และดื่มแอลกอฮอล์</li>
        </ul>
        <h4>อาหารที่ควรเลี่ยง</h4>
        <ul>
            <li>เลี่ยงรับประทานไขมันสัตว์ เช่น มันหมู หมูสามชั้น สันคอหมู ขาหมูติดมัน หนังเป็ดพะโล้ ก้นไก่ เป็นต้น</li>
            <li>เลี่ยงรับประทานไขมันจากน้ำมะพร้าวแก่ เช่น กะทิข้น ควรงดแกงเผ็ดใส่กะทิ แกงเขียวหวาน แกงคั่ว แกงกะหรี่ ฯลฯ
            </li>
            <li>เลี่ยงอาหารที่มีโคเลสเตอรอลสูง เช่น ไข่ปลา ไข่แดง ตับ ไต มันสมอง ปลาหมึก หอยนางรม จำกัดไข่แดงไม่เกิน 3-4 ฟอง
            </li>
            <li>ต่อสัปดาห์ ส่วนไข่ขาวรับประทานได้ทุกวัน สำหรับเครื่องในสัตว์ไม่ควรรับประทานบ่อย จำกัดครั้งละ 2-3 ชิ้น</li>
            <li>เลี่ยงการใช้น้ำมันมะพร้าว น้ำมันปาล์ม และไขมันจากสัตว์ เช่น มันไก่ มันหมูมาหลอมเป็นน้ำมันเพื่อปรุงอาหาร
                ควรใช้น้ำมันรำข้าวเป็นหลักในการผัดและทอดอาหาร </li>
            <li>ลดอาหารที่เติมน้ำตาล ทั้งขณะปรุงประกอบอาหาร</li>
            <li>เลี่ยงการดื่มเครื่องดื่มชูกำลังและเครื่องดื่มแอลกอฮอล์ทุกชนิด เพราะมีผลทำให้ระดับ</li>
        </ul>
        <h4>อาหารที่กินได้</h4>
        <ul>
            <li>เลือกรับประทานอาหารที่มีเส้นใยอาหารสูง ได้แก่ ผัก ผลไม้ ข้าวกล้อง ธัญพืชที่ไม่ผ่านการขัดสีหรือขัดสีน้อย
            </li>
            <li>เลือกรับประทานอาหารที่ไม่ใช้น้ำมัน เช่น ยำต่างๆ แกง </li>
            <li>เลือกรับประทานถั่วเปลือกแข็ง ถั่วเหลือง และปลาทู ปลาโอ ปลาทูน่า ปลาซาบะ ไขมันใต้ผิวหนัง ปลาทะเลดังกล่าวมีกรด
            </li>
            <li>ไขมันชนิดโอเมก้า 3 อยู่มาก ช่วยลดระดับไตรกลีเซอไรด์ในเลือดได้ดี อย่างน้อยสัปดาห์ละ 3-4 ครั้ง </li>
            <li>เลือกรับประทานนมชนิดไขมันต่ำ (นมพร่องมันเนย) แทนนมสดครบส่วน </li>
            <li>เลือกรับประทานไอศกรีมไขมันต่ำหรือเชอเบท แทนไอศกรีมกะทิและไอศกรีมที่ทำจากนมและครีม</li>
        </ul>
        <hr>
    </div>
 {{-- ไม่ต้องแก้ --}}
 <div class="container">
    <h4>อาหารที่สามารถรับประทานได้</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($foods as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่ควรหลีกเลี่ยง</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($inedibleFood as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
@endsection
