@extends('layouts.index')
@section('content')
https://www.pobpad.com/%E0%B9%84%E0%B8%82%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%83%E0%B8%99%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%94%E0%B8%AA%E0%B8%B9%E0%B8%87
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคไขมันในเลือดสูง</h1>
        <p style="text-indent: 50px;">โรคไขมันในเลือดสูงคือภาวะที่ร่างกายมีไขมันในเลือดมากกว่าปกติ ไขมันที่สูงนั้นอาจเป็นโคเลสเตอรอล (Cholesterol) หรือ ไตรกลีเซอไรด์ (Triglyceride) ภาวะไขมันในเส้นเลือดสูง เรียกว่า Hyperlipidemia เป็นปัจจัยเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด เส้นเลือดตีบอุดตัน เลือดไหลไปเลี้ยงอวัยวะต่างๆ ของร่างกายไม่เพียงพอและเป็นอันตรายถึงแก่ชีวิตได้</h4>
         <h4>สาเหตุของภาวะไขมันในเลือดสูง</h4>
         <p >1. ความผิดปกติทางกรรมพันธุ์ ทำให้ร่างกายเผาผลาญทำลายไขมันลดลง</p>
         <p >2. การใช้ยาบางชนิด หรือโรคบางอย่าง เช่น ยาขับปัสสาวะ ยาคุมกำเนิด โรคเบาหวาน โรคต่อมไทรอยด์ทำงานได้น้อย โรคไต เป็นต้น</p>
         <p >3. การรับประทานอาหารที่ผิดหลักโภชนาการ</p>
         <ul>
            <li>ความผิดปกติของต่อมไรท่อ เช่น ต้อมใต้สมอง ต่อมไทรอยด์</li>
            <li>ภาวะเครียด</li>
            <li>จิตใจและอารมณ์</li>
            <li>กรรมพันธุ์</li>
        </ul>
         <p >4. การดื่มเหล้าหรือเครื่องดื่มที่มีแอลกอฮอล์ ในปริมาณมากและเป็นประจำ</p>
        <h4>อาหารที่ควรเลี่ยง</h4>
        <ul>
            <li>เลี่ยงรับประทานไขมันสัตว์  เช่น มันหมู หมูสามชั้น สันคอหมู ขาหมูติดมัน หนังเป็ดพะโล้ ก้นไก่ เป็นต้น</li>
            <li>เลี่ยงรับประทานไขมันจากน้ำมะพร้าวแก่ เช่น กะทิข้น ควรงดแกงเผ็ดใส่กะทิ แกงเขียวหวาน แกงคั่ว แกงกะหรี่ ฯลฯ </li>
            <li>เลี่ยงอาหารที่มีโคเลสเตอรอลสูง  เช่น ไข่ปลา ไข่แดง ตับ ไต มันสมอง ปลาหมึก หอยนางรม จำกัดไข่แดงไม่เกิน 3-4 ฟอง</li>
            <li>ต่อสัปดาห์ ส่วนไข่ขาวรับประทานได้ทุกวัน สำหรับเครื่องในสัตว์ไม่ควรรับประทานบ่อย จำกัดครั้งละ 2-3 ชิ้น</li>
            <li>เลี่ยงการใช้น้ำมันมะพร้าว น้ำมันปาล์ม และไขมันจากสัตว์ เช่น มันไก่ มันหมูมาหลอมเป็นน้ำมันเพื่อปรุงอาหาร ควรใช้น้ำมันรำข้าวเป็นหลักในการผัดและทอดอาหาร </li>
            <li>ลดอาหารที่เติมน้ำตาล ทั้งขณะปรุงประกอบอาหาร</li>
            <li>เลี่ยงการดื่มเครื่องดื่มชูกำลังและเครื่องดื่มแอลกอฮอล์ทุกชนิด เพราะมีผลทำให้ระดับ</li>
        </ul>
        <h4>อาหารที่กินได้</h4>
        <ul>
            <li>เลือกรับประทานอาหารที่มีเส้นใยอาหารสูง ได้แก่ ผัก ผลไม้ ข้าวกล้อง ธัญพืชที่ไม่ผ่านการขัดสีหรือขัดสีน้อย </li>
            <li>เลือกรับประทานอาหารที่ไม่ใช้น้ำมัน เช่น ยำต่างๆ แกง </li>
            <li>เลือกรับประทานถั่วเปลือกแข็ง ถั่วเหลือง และปลาทู ปลาโอ ปลาทูน่า ปลาซาบะ ไขมันใต้ผิวหนัง ปลาทะเลดังกล่าวมีกรด</li>
            <li>ไขมันชนิดโอเมก้า 3 อยู่มาก ช่วยลดระดับไตรกลีเซอไรด์ในเลือดได้ดี อย่างน้อยสัปดาห์ละ 3-4 ครั้ง </li>
            <li>เลือกรับประทานนมชนิดไขมันต่ำ (นมพร่องมันเนย) แทนนมสดครบส่วน </li>
            <li>เลือกรับประทานไอศกรีมไขมันต่ำหรือเชอเบท แทนไอศกรีมกะทิและไอศกรีมที่ทำจากนมและครีม</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคอ้วน</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่ควรหลีกเลี่ยง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($inedibleFood as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="{{ asset('foodshow/' . $food->id) }}">
                            <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px; object-fit: cover;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
@endsection
