@extends('layouts.index')
@section('content')
https://hellokhunmor.com/%e0%b8%aa%e0%b8%b8%e0%b8%82%e0%b8%a0%e0%b8%b2%e0%b8%9e%e0%b8%ab%e0%b8%b1%e0%b8%a7%e0%b9%83%e0%b8%88/%e0%b9%82%e0%b8%a3%e0%b8%84%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b8%94%e0%b8%b1%e0%b8%99%e0%b9%82%e0%b8%a5%e0%b8%ab%e0%b8%b4%e0%b8%95%e0%b8%aa%e0%b8%b9%e0%b8%87/%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b8%94%e0%b8%b1%e0%b8%99%e0%b9%82%e0%b8%a5%e0%b8%ab%e0%b8%b4%e0%b8%95%e0%b8%aa%e0%b8%b9%e0%b8%87-%e0%b9%82%e0%b8%a3%e0%b8%84%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b8%94%e0%b8%b1%e0%b8%99%e0%b9%82%e0%b8%a5%e0%b8%ab%e0%b8%b4%e0%b8%95%e0%b8%aa%e0%b8%b9%e0%b8%87/
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคความดันโลหิตสูง</h1>
        <p style="text-indent: 50px;">โรคความดันโลหิตสูงเป็นภาวะความดันเลือดภายในหลอดเลือดแดงสูงกว่าปกติตลอดเวลา
            หากไม่ได้รับการรักษาที่ถูกต้องจะส่งผลให้เกิดปัญหาสุขภาพร้ายแรงจนอาจถึงขั้นเสียชีวิตได้</p>
        <h4>สาเหตุของโรคความดันโลหิตสูง</h4>
        <p style="text-indent: 50px;">โรคความดันสูงแบ่งเป็น 2 ประเภท คือ ชนิดไม่ทราบสาเหตุแน่ชัด (Primary/Essential
            hypertension) ที่ไม่สามารถระบุต้นเหตุของการเกิดโรคได้ และชนิดทราบสาเหตุ (Secondary hypertension)
            ที่อาจเกิดได้จากหลายสภาวะ เช่น ภาวะหยุดหายใจขณะหลับ โรคไต ปัญหาต่อมไทรอยด์ เนื้องอกที่ต่อมหมวกไต
            หลอดเลือดผิดปกติแต่กำเนิด การใช้ยาบางชนิด สารเสพติด หรือแอลกอฮอล์</p>
        <h4>เป็นความดันสูงห้ามกินอะไรบ้าง</h4>
        <ul>
            <li>อาหารที่มีน้ำตาลเป็นส่วนประกอบ เช่น เค้ก คุกกี้ ไอศกรีม ขนมหวาน และช็อกโกแลต</li>
            <li>เครื่องดื่มที่มีน้ำตาล เช่น น้ำหวาน น้ำอัดลม นมเปรี้ยว นมปรุงแต่งรส น้ำผลไม้ เครื่องดื่มชูกำลัง
                และน้ำเกลือแร่</li>
        </ul>
        <h4>อาหารที่รับประทานได้แต่ควรกำหนดปริมาณ</h4>
        <ul>
            <li>อาหารโซเดียมสูง เช่น อาหารเค็ม อาหารรสจัด อาหารแปรรูป เครื่องปรุง ฯลฯ เนื่องจากการได้รับโซเดียมเกิน</li>
            <li>อาหารไขมันสูง เช่น อาหารมัน อาหารทอด เบเกอรี่บางชนิด ฯลฯ เนื่องจากการได้รับไขมันมากเกินไป</li>
            <li>อาหารน้ำตาลสูง เช่น ขนมหวาน น้ำหวาน น้ำอัดลม ฯลฯ เนื่องจากการได้รับน้ำตาลเกินพอดี</li>
            <li>เครื่องดื่มแอลกอฮอล์ เช่น เหล้า เบียร์ ไวน์ ฯลฯ เนื่องจากการได้รับแอลกอฮอล์มากเกินไป</li>
            <li>เครื่องดื่มที่มีคาเฟอีน เช่น ชา กาแฟ เครื่องดื่มชูกำลัง น้ำอัดลม ฯลฯ เนื่องจากคาเฟอีนนั้นหากได้รับมากเกินไป
            </li>
        </ul>
        <h4>สามารถกินเพื่อลดความดัน</h4>
        <ul>
            <li>ข้าว แป้ง ธัญพืช 6-8 ส่วนต่อวัน (ประมาณ 6-8 ทัพพี) เน้นเป็นประเภทไม่ขัดสี เช่น ข้าวกล้อง ข้าวหอมนิล ข้าวไรซ์
                ฯลฯ</li>
            <li>ผัก 4-5 ส่วนต่อวัน (ประมาณ 4-5 ทัพพี) โดยเน้นให้มีความหลากหลาย</li>
            <li>ผลไม้ 4-5 ส่วนต่อวัน (ประมาณ 4-5 จานรองกาแฟ) โดยเน้นให้มีความหลากหลาย</li>
            <li>เนื้อสัตว์ 6 ส่วนต่อวัน (ประมาณ 12 ช้อนกินข้าว) เน้นเป็นเนื้อสัตว์ที่มีไขมันต่ำ เช่น ปลา อกไก่ไม่ติดหนัง
                สันในหมู ไข่ขาว ฯลฯ</li>
            <li>นมวัวและผลิตภัณฑ์จากนมวัว 2-3 ส่วนต่อวัน (ประมาณ 2-3 แก้ว) เน้นเป็นสูตรไขมันต่ำ เช่น นมพร่องมันเนย ฯลฯ</li>
            <li>ถั่วและเมล็ด 4-5 ส่วนต่อสัปดาห์ (ประมาณ 4-5 กำมือ) เช่น ถั่วลิสง อัลมอนด์ เม็ดมะม่วงหิมพานต์ เมล็ดทานตะวัน
                ฯลฯ</li>
            <li>ไขมัน 2-3 ส่วนต่อวัน (ไขมัน 1 ส่วน ก็อย่างเช่น น้ำมัน 1 ช้อนชา มายองเนส 1 ช้อนโต๊ะ น้ำสลัด 2 ช้อนโต๊ะ
                เป็นต้น) โดยเน้นเป็นไขมันจากพืช</li>
            <li>น้ำตาลและของหวาน ไม่เกิน 5 ส่วนต่อสัปดาห์ (น้ำตาลและของหวาน 1 ส่วน ก็อย่างเช่น น้ำตาล 1 ช้อนโต๊ะ แยม 1
                ช้อนโต๊ะ น้ำหวาน 0.5-1 แก้ว เป็นต้น)</li>
            <li>โซเดียม ไม่เกิน 2,300 มิลลิกรัมต่อวัน หรืออาจปรับเป็นไม่เกิน 1,500 มิลลิกรัมต่อวันแทน
                เพื่อให้ได้ผลการลดความดันที่ดียิ่งขึ้น</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคความดันโลหิตสูง</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
