@extends('layouts.index')
@section('content')
    https://www.thairath.co.th/lifestyle/life/2504171
    https://hd.co.th/what-to-eat-when-you-have-kidney-disease
    <div class="text-center mt-5">
        <img src="{{ asset('img/1.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคไต</h1>
        <p style="text-indent: 50px;">ภาวะที่ทำให้ไตเกิดความเสียหายหรือทำงานผิดปกติจนเกิดอาการเจ็บป่วยต่าง ๆ ตามมา
            เนื่องจากไตไม่สามารถฟอกเลือดหรือขับของเสียออกจากเลือดได้ตามปกติ หากป่วยเป็นโรคไต
            ผู้ป่วยต้องเข้ารับการรักษาอย่างถูกต้องเหมาะสม
            เพื่อบรรเทาอาการและป้องกันการเกิดภาวะแทรกซ้อนที่เป็นอันตรายต่อชีวิต ดังนั้น
            หากสังเกตพบอาการที่บ่งชี้ว่าไตมีปัญหา ควรรีบไปพบแพทย์เพื่อรับการตรวจรักษาให้ทันการณ์</p>
        <p>สาเหตุโรคไต</p>
        <p>1.กลั้นปัสสาวะบ่อยๆ สาเหตุโรคไตข้อนี้ทำให้เพิ่มความเสี่ยงต่อการติดเชื้อในทางเดินปัสสาวะ</p>
        <p>2.รับประทานยาหรือสมุนไพรอย่างไม่ระมัดระวัง เนื่องจากยาและสมุนไพรหลายชนิดส่งผลต่อการไหลเวียนเลือดมาเลี้ยงไต</p>
        <p>3.ดื่มน้ำน้อย สาเหตุโรคไตข้อนี้ส่งผลให้ปริมาณเลือดในร่างกายลดลง ปริมาณเลือดที่ไหลเวียนไปเลี้ยงอวัยวะสำคัญลดลง</p>
        <p>4.รับประทานอาหารไขมันสูง สาเหตุโรคไตข้อนี้ส่งผลให้เกิดการสะสมของไขมันที่ผนังหลอดเลือดทั่วร่างกาย
            สิ่งที่เป็นอันตราย คือ การมีไขมันสะสมที่ผนังหลอดเลือดหัวใจ สมอง และไต เพราะจะส่งผลให้เกิดการตีบแคบของหลอดเลือด
            มีปริมาณเลือดไหลเวียนมาที่อวัยวะนั้นลดลง</p>
        <p>5.รับประทานอาหารรสเค็มจัด เนื่องจากอาหารรสจัดมีการใช้เครื่องปรุงแต่ละชนิดในปริมาณมาก
            เพื่อทำให้เกิดรสชาติที่เข้มข้น และแน่นอน เครื่องปรุงเหล่านั้นจะขาดเกลือหรือเกลือโซเดียม ไม่ได้
            เกลือโซเดียมจะกระตุ้นให้ไตทำงานหนักขึ้น ส่งผลให้เพิ่มปริมาณเลือดไหลเวียนในร่างกาย ทำให้ไตทำงานลดลง</p>
        <p>6.สูบบุหรี่ สารในบุหรี่ส่งผลให้เกิดการเปลี่ยนแปลงของหลอดเลือด หากหลอดเลือดที่ไปเลี้ยงไตมีการเปลี่ยนแปลง</p>
        <p>7.ดื่มสุราหรือเครื่องดื่มที่มีแอลกอฮอล์เป็นประจำ สาเหตุโรคไตข้อนี้จะทำให้ร่างกายมีการสูญเสียน้ำมากขึ้น
            เนื่องจากแอลกอฮอล์เป็นตัวเร่งให้ร่างกายขับน้ำเพิ่มขึ้น จึงส่งผลให้ไตเสียหน้าที่จาก 2 สาเหตุ ได้แก่ เกิดการขาดน้ำ
            และไตทำหน้าที่มากกว่าปกติ</p>
        <h4>อาหารที่ผู้ป่วยโรคไตควรหลีกเลี่ยง</h4>
        <ul>
            <li>อาหารที่มีโพแตสเซียมสูง เพราะโพแตสเซียมเป็นเกลือแร่ในเลือดชนิดหนึ่ง
                มีหน้าที่เกี่ยวกับการหดและคลายตัวของกลามเนื้อ หากมีโพแตสเซียมสูงเกินไปจะทำให้กล้ามเนื้ออ่อนแรง เหนื่อยหอบ
                อ่อนเพลีย ใจสั่น คลื่นไส้ เป็นตะคริว ชีพจรเต้นช้าลง หรือจนถึงขั้นหัวใจหยุดเต้นได้</li>
            <li>จำกัดอาหารที่มีโปรตีนสูง เพราะเมื่อร่างกายเผาผลาญโปรตีนจะเกิดของเสียที่ทำให้ไตต้องทำงานหนักขึ้น
                แต่อย่างไรก็ตาม ร่างกายก็ยังต้องการโปรตีนเพื่อช่วยซ่อมแซมส่วนที่สึกหรออยู่</li>
            <li>ควบคุมคาร์โบไฮเดรต หากผู้ป่วยต้องจำกัดโปรตีนต่ำมากๆ
                อาจต้องควบคุมคาร์โบไฮเดรตจากข้าวบางชนิดที่มีโปรตีนอยู่ด้วย</li>
            <li>อาหารที่มีไขมันสูง เพราะไขมันมีส่วนสัมพันธ์ต่อการทำงานของไตที่แย่ลง ไขมันจำพวกไขมันอิ่มตัว ไขมันทรานส์
                ไขมันสัตว์ เช่น หมูสามชั้น ไข่ทอดฟู หนังไก่ หนังเป็ด ปาท่องโก๋ เค้ก พาย คุกกี้</li>
            <li>อาหารที่มีโซเดียมสูง ผู้ป่วยโรคไตไม่ควรได้รับโซเดียมเกิน 2,000 มิลลิกรัมต่อวัน
                แต่อาหารหลายชนิดในปัจจุบันมีโซเดียมปริมาณมาก ฉะนั้นควรหลีกเลี่ยงอาหารที่มีโซเดียมสูง</li>
            <li>อาหารที่มีฟอสฟอรัสสูง หากมีระดับฟอสฟอรัสในเลือดสูงเกินเกณฑ์ ต้องหลีกเลี่ยงไข่แดง นมทุกรูปแบบ
                รวมทั้งผลิตภัณฑ์จากนม</li>
            <li>อาหารที่มีพิวรีนสูง ผู้ที่มีกรดยูริกในเลือดสูงควรลดอาหารที่มีพิวรีน
                เนื่องจากพิวรีนจะทำให้เกิดกรดยูริกในร่างกาย</li>
            <li>อย่ากินน้ำเปล่าเยอะเกินไป ผู้ที่เป็นโรคไตเรื้อรังบางรายจะมีอาการบวมน้ำ เนื่องจากไตขับปัสสาวะได้น้อยลง
                และมีความดันโลหิตสูง ให้ดื่มน้ำไม่เกินวันละ 750-1,000 มิลลิลิตร (3-4 แก้วต่อวัน)</li>

        </ul>
        <h4>อาหารสำหรับผู้ป่วยโรคไต</h4>
        <ul>
            <li>เลือกโปรตีนจากปลาเป็นหลัก โดยเฉพาะปลาทะเลน้ำลึก เช่น ปลาซาบะ ปลาโอ เพราะมีโอเมก้า 3 ซึ่งเป็นกรดไขมันที่ดี
                และไม่ทำให้คอเลสเตอรอลในเลือดเพิ่มมากขึ้น</li>
            <li>ใช้แป้งปลอดโปรตีน ซึ่งเป็นแหล่งให้พลังงานที่สำคัญ เช่น วุ้นเส้น ก๋วยเตี๋ยวเซี่ยงไฮ้ เพิ่มเติมจากข้าวได้
                หรือรับประทานขนมที่ทำจากแป้งปลอดโปรตีน เช่น ซาหริ่ม สาคูเปียก เพื่อให้ได้รับพลังงานที่เพียงพอ
                แต่หากผู้ป่วยเป็นเบาหวานด้วยก็ควรใช้น้ำตาลเทียม หรือน้ำตาลจากหญ้าหวานแทน</li>
            <li>เลือกอาหารที่ไม่มีไขมันเป็นส่วนประกอบ หรือมีไขมันน้อย โดยการทำอาหารอื่นๆ ที่ไม่ต้องใช้น้ำมันเยอะ เช่น แกงส้ม
                ยำผักกระเฉด ยำผักบุ้ง หรือหากรับประทานอาหารทอดก็ควรใช้นำมันรำข้าวเพียงเล็กน้อยเท่านั้น</li>
            <li>ประกอบอาหารด้วยตัวเอง
                คนที่เป็นโรคไตมีความเสี่ยงที่จะรับแร่ธาตุเกินความจำเป็นจากการรับประทานอาหารตามสั่งนอกบ้าน
                เพราะมีรสชาติเค็มจัด หวานจัด หรือมันจัด ฉะนั้นควรประกอบอาหารด้วยตัวเอง โดยใช้วิธีนึ่ง อบ ต้ม แทน
                และปรุงรสไม่จัดจนเกินไป</li>
        </ul>
        <hr>
    </div>
    {{-- ไม่ต้องแก้ --}}
    <div class="container">
        <h4>อาหารที่เหมาะกับคนที่เป็นโรคไต</h4>
        <div class="row row-cols-1 row-cols-md-4">
            @foreach ($foods as $food)
                <div class="col d-flex justify-content-center">
                    <div class="card" style="width: 290px;">
                        <a href="#">
                            <img src="{{ asset('storage/img/' . $food->picture) }}" class="card-img-top"
                                style="width: 100%; height:240px;">
                            <div class="card-body">
                                <p class="card-text">{{ $food->foodname }}</p>
                                <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                            </div>
                        </a>
                    </div>
                </div>
            @endforeach
        </div>
    </div>
    {{-- ไม่ต้องแก้ --}}
@endsection
