@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/kidney.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคไต</h1>
        <h4>โรคไตมีกี่ระยะ อาการและวิธีรักษาเป็นอย่างไร</h4>
        <p style="text-indent: 50px;">หลายคนอาจไม่รู้มาก่อนว่าโรคไตหรือโรคไตเรื้อรังมีหลายระยะด้วยกัน
            ซึ่งแต่ละระยะมีอาการและวิธีการรักษาที่ต่างกันออกไป
            วันนี้เรารวบรวมข้อมูลมาให้แล้วว่าโรคไตมีกี่ระยะและต้องทำการดูแลรักษาอย่างไรบ้าง</p>
        <h4>โรคไตมีกี่ระยะ</h4>
        <p style="text-indent:50px;">โรคไตหรือโรคไตเรื้อรังแบ่งออกเป็น 5 ระยะด้วยกัน โดยแบ่งจากระยะของโรคไตตามสาเหตุ
            และตามโรคร่วม เช่น โรคเบาหวาน โรคความดันโลหิตสูง โรคพันธุกรรม โรคที่เกิดจากปัจจัยสิ่งแวดล้อม
            และโครงสร้างทางกายวิภาคของไต เป็นต้น และแบ่งระยะตามระดับอัตราการกรองของไตหรือ eGFR (estimated glomerular
            filtration rate) คือปริมาณเลือดที่ไหลผ่านตัวกรองของไตในหนึ่งนาที
            ซึ่งแต่ละระยะจะมีอาการและวิธีการรักษาที่ต่างกันออกไป</p>
        <p>โรคไตระยะที่ 1 มีค่า eGFR มากกว่า 90% อาการคือมีภาวะไตผิดปกติ เช่น มีโปรตีนรั่วในปัสสาวะ แต่อัตราการกรองยังปกติดี
            เป็นระยะที่อยู่ในระดับที่มีความเสี่ยงต่ำ</p>
        <p>โรคไตระยะที่ 2 มีค่า eGFR อยู่ในช่วงระยะ 60-89% อาการคือมีภาวะไตผิดปกติ เช่น มีโปรตีนรั่วในปัสสาวะ
            อัตราการกรองลดลงเล็กน้อย เป็นระยะที่เราจะเริ่มประเมินและชะลอการเสื่อมของโรคไตเรื้อรัง</p>
        <p>โรคไตระยะที่ 3 มีค่า eGFR อยู่ในช่วงระยะ 30-60% อาการที่พบคือมีอัตราการกรองลดลงเล็กน้อยไปจนถึงปานกลาง
            เป็นระยะที่แพทย์จะเพิ่มการดูแลภาวะแทรกซ้อนของไต
            และต้องระวังในเรื่องของโรคหัวใจที่จะเป็นภาวะแทรกซ้อนและทำให้ผู้ป่วยโรคไตเสียชีวิตได้มาก</p>
        <p>โรคไตระยะที่ 4 มีค่า eGFR น้อยกว่า 30% ซึ่งอัตราการกรองลดลงมาก
            ระยะนี้แพทย์จะต้องเริ่มปรึกษาเรื่องการทำบำบัดทดแทนไต เพราะการฟอกไตไม่ว่าจะฟอกเลือดด้วยเครื่องฟอกไตเทียม
            การฟอกไตทางหน้าท้อง หรือการปลูกถ่ายไต</p>
        <p>โรคไตระยะที่ 5 มีค่า eGFR น้อยกว่า 15% เข้าสู่อาการไตวายระยะสุดท้าย โดยแพทย์จะเริ่มการบำบัดทดแทนไต
            ตามที่ได้ปรึกษากันแล้วก่อนหน้านี้ โดยเริ่มการบำบัดทดแทนไตในเวลาที่เหมาะสม</p>
        <h4>อาการของไตวายเรื้อรังระยะสุดท้าย</h4>
        <p>สำหรับผู้ป่วยโรคไตในระยะที่ 5 ซึ่งเป็นระยะสุดท้ายจะมีการทำงานของไตลดลงเหลือ 15%
            ส่งผลให้มีอาการทางระบบอื่นตามมามากขึ้น เช่น คลื่นไส้ อาเจียน รับประทานอาหารไม่ได้จนมีภาวะขาดสารอาหาร
            ความดันโลหิตสูง โลหิตจาง เยื่อหุ้มหัวใจอักเสบ สะอึก บวม หอบเหนื่อย อาจมีอาการหอบจากการคั่งของกรดในร่างกาย
            ถ้ามีอาการหนักมากและไม่ได้รับการรักษาผู้ป่วยจะมีอาการซึมลงและชักได้</p>
        <h4>อาการของโรคไต</h4>
        <p>สำหรับผู้ป่วยโรคไตหรือผู้ที่ไม่มั่นใจว่าตนเองป่วยเป็นโรคไตหรือไม่
            อาการของโรคไตที่สามารถสังเกตได้ด้วยตนเองมีดังนี้</p>
        <ul>
            <li>ปัสสาวะบ่อยตอนกลางคืน เป็นอาการที่พบได้เมื่อการทำงานของไตเริ่มเสื่อมลงในระยะแรก</li>
            <li>ขาบวมและกดบุ๋ม สาเหตุจากมีเกลือและน้ำคั่งในร่างกาย หรือมีโปรตีนรั่วจำนวนมากในปัสสาวะ
                หากบวมมากจะทำให้เกิดอาการหอบเหนื่อยจากการมีน้ำคั่งในปอด ซึ่งอาจเป็นอันตรายต่อชีวิต</li>
            <li>ความดันโลหิตสูง</li>
            <li>คลื่นไส้ อาเจียน อ่อนเพลีย คันตามร่างกาย</li>
            <li>ผู้หญิงอาจมีอาการประจำเดือนขาดหรือไม่สามารถตั้งครรภ์ได้ ส่วนผู้ชายจะมีความรู้สึกทางเพศลดลงและสร้างอสุจิลดลง
            </li>
        </ul>
        <p>การดูแลรักษาโรคไตมีหลายลักษณะ โดยจะต้องรักษาตามระยะของโรค ดังนี้</p>
        <ul>
            <li>โรคไตระยะที่ 1 ต้องงดสูบบุหรี่ รักษาควบคุมโรคที่เป็นสาเหตุของโรคไต โรคไตเรื้อรัง</li>
            <li>โรคไตระยะที่ 2 ต้องจำกัดความเค็ม</li>
            <li>โรคไตระยะที่ 3 จำกัดอาหารโปรตีน</li>
            <li>โรคไตระยะที่ 4 จำกัดการกินผลไม้</li>
            <li>โรคไตระยะที่ 5 ต้องรักษาโดยการล้างไตหน้าท้อง ฟอกเลือด หรือผ่าตัดปลูกไต
                ซึ่งเป็นวิธีที่ดีที่สุดสำหรับผู้ป่วยระยะสุดท้าย</li>
        </ul>
        <hr>
    </div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่สามารถรับประทานได้</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($foods as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่ควรหลีกเลี่ยง</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($inedibleFood as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
@endsection
