@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/disease/osteoarthritis.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>โรคข้อเข่าเสือม</h1>
        <p style="text-indent: 50px;">สังคมไทยกำลังจะเข้าสู่สังคมผู้สูงอายุเต็มตัว ค่าเฉลี่ยอายุขัยของประชากรมีแนวโน้มมากขึ้น
            เช่นเดียวกันกับอุบัติการณ์ของโรคข้อเข่าเสื่อมที่มีแนวโน้มเพิ่มขึ้นเรื่อย ๆ</p>
        <p style="text-indent: 50px;">เมื่อเราพูดถึง "ข้อเสื่อม" สิ่งแรกที่เราควรรู้จักคือ "กระดูกอ่อนผิวข้อ" (Articular
            Cartilage) ข้อต่อของร่างกายเป็นจุดที่มีการเคลื่อนไหวเพื่อให้การเคลื่อนไหวนั้นราบรื่น ไม่สะดุด
            บริเวณปลายกระดูกตรงผิวของข้อต่อจึงต้องมีลักษณะพิเศษ คือมีความมันวาว ลื่น และความยืดหยุ่น
            เพื่อทำให้ทนต่อการรับแรงกดที่ลงมาที่ข้อต่อได้รวมไปถึงในข้อต่อของเรายังมีน้ำหล่อลื่นข้อเพื่อช่วยลดแรงเสียดทานในการเคลื่อนไหวอีกด้วย
        </p>
        <p style="text-indent: 50px;">เวลาเกิดข้อเข่าเสื่อมจริง ๆ แล้ว ส่วนที่เสื่อมก็คือ "กระดูกอ่อนผิวข้อ"
            นี่ล่ะที่เสื่อมไป เมื่อเราอายุมากขึ้น ข้อเข่าผ่านการใช้งานนาน ๆ ทั้งการเดิน การขยับงอเหยียดฟ
            มีแรงกระแทกลงข้อเข่าซ้ำ ๆ ร่วมกับการเปลี่ยนแปลงภายในกระดูกอ่อนผิวข้อเองที่ความยืดหยุ่นลดลง
            ทำให้เกิดการแตกสลายหลุดลอกออกของกระดูกอ่อนผิวข้อ เมื่อกระดูกอ่อนผิวข้อหลุดออกไป
            ชั้นใต้กระดูกอ่อนผิวข้อซึ่งเป็นกระดูกทั่วไปที่มีความแข็ง สาก ไม่ยืดหยุ่น ไม่ได้ถูกออกแบบมาให้รองรับการเคลื่อนไหว
            เมื่อเกิดการเดิน ขยับ งอเหยียด
            กระดูกแข็งตรงนี้ก็จะมาเสียดสีกันทำให้เกิดอาการเจ็บปวดเกิดการอักเสบบวมเปรียบเสมือนข้อต่อเครื่องยนต์ที่ไม่มีน้ำมันหล่อลื่น
        </p>
        <h4>ปัจจัยเสี่ยงของข้อเข่าเสื่อม</h4>
        <p>ปัจจัยเสี่ยงของข้อเข่าเสื่อมแบ่งได้เป็น 2 แบบหลัก ๆ คือ</p>
        <ul>
            <li>แบบที่ปรับเปลี่ยนไม่ได้ เช่น อายุที่มากขึ้น เพศหญิง พันธุกรรม</li>
            <li>แบบที่ปรับเปลี่ยนได้ เช่น การเกิดอุบัติเหตุที่ทำให้กระดูกผิวข้อบาดเจ็บ อาชีพที่ต้องใช้งาน งอเข่าซ้ำ ๆ
                น้ำหนักตัวที่มาก กล้ามเนื้อต้นขาอ่อนแรง และกลุ่มโรคความดันสูง ไขมันสูง เบาหวาน</li>
        </ul>
        <p>แบบที่น่าสนใจกว่าสำหรับเราคือแบบที่ 2 เพราะว่าหากเราหลีกเลี่ยงปัจจัยเสี่ยงตรงนี้ได้
            โอกาสที่เราจะเกิดภาวะข้อเข่าเสื่อมก็จะลดลง</p>
        <h4>อาการของข้อเข่าเสื่อม</h4>
        <p>อาการของโรคข้อเข่าเสื่อมมีได้หลายรูปแบบตามระดับความรุนแรงและพยาธิสภาพที่เกิดขึ้น อาการหลัก ๆ
            ที่ทำให้มาพบแพทย์แบ่งได้เป็น 3 กลุ่มใหญ่ ๆ ได้แก่</p>
        <ul>
            <li>อาการปวด (Pain) ลักษณะอาการปวดจะเป็นอาการปวดเรื้อรัง ตรงบริเวณข้อเข่า สัมพันธ์กับการเดิน การใช้งาน
                ถ้านั่งเฉยๆก็จะไม่ปวด อาจจะมีเสียงกรอบแกรบร่วมด้วยเวลาขยับซึ่งเกิดจากการที่กระดูกแข็งมากระทบเสียดสีกัน
                ยิ่งอาการข้อเสื่อมเป็นรุนแรงขึ้น อาการปวดก็จะยิ่งมากขึ้น</li>
            <li>ใช้งานไม่ได้ (Dysfunction) เดินแล้วเจ็บ หรือเมื่อนั่งนานๆพอลุกแล้วจะเดินทันทีเลยไม่ได้
                ต้องค่อยๆตั้งหลักก่อนจึงจะเดินต่อได้</li>
            <li>ความผิดรูป (Deformity) ในกรณีที่เป็นรุนแรงมากจนกระดูกอ่อนผิวข้อหายไปหมด เมื่อกระดูกแข็งเสียดสีกันซ้ำนาน ๆ ไป
                ก็จะทำให้เกิดกระดูกงอก รวมถึงกระดูกบางจุดมีการทรุดตัวลง ทำให้เกิดความผิดรูป ซึ่งมีได้หลายแบบเช่น เข่าโก่ง
                เข่าฉิ่ง เข่าแอ่น เข่าเหยียดได้ไม่สุด เป็นต้น
            </li>
        </ul>
        <h4>แนวทางการรักษา</h4>
        <p style="text-indet: 50px;">โดยปกติแนวทางการรักษาขึ้นอยู่กับระดับความรุนแรงของภาวะข้อเสื่อม
            โดยจะเริ่มต้นจากการรักษาแบบไม่ผ่าตัดก่อนซึ่งได้แก่ การให้ความรู้ ลดน้ำหนัก บริหารกล้ามเนื้อต้นขาให้แข็งแรง
            และกินยาลดการอักเสบแก้ปวดตามอาการ</p>
        <p style="text-indet: 50px;">
            อย่างไรก็ดีในผู้ป่วยที่อาการของข้อเสื่อมมีระดับความรุนแรงมากแล้วการรักษาแบบไม่ผ่าตัดมักจะไม่ได้ผล
            จึงแนะนำรักษาโดยการผ่าตัดใส่ข้อเข่าเทียมซึ่งจะช่วยให้ผู้ป่วยหายปวดปรับแนวข้อเข่าให้ปกติทำให้เดินและใช้งานได้ดีขึ้นช่วยให้ผู้ป่วยมีคุณภาพชีวิตที่ดีขึ้น
        </p>
        <hr>
    </div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่สามารถรับประทานได้</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($foods as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
{{-- ไม่ต้องแก้ --}}
<div class="container">
    <h4>อาหารที่ควรหลีกเลี่ยง</h4>
    <div class="row row-cols-1 row-cols-md-4">
        @foreach ($inedibleFood as $food)
            <div class="col d-flex justify-content-center">
                <div class="card" style="width: 290px;">
                    <a href="{{ asset('foodshow/' . $food->id) }}">
                        <img src="{{ asset('storage/image/' . $food->picture) }}" class="card-img-top"
                            style="width: 100%; height:240px; object-fit: cover;">
                        <div class="card-body">
                            <p class="card-text">{{ $food->foodname }}</p>
                            <i class="fa-solid fa-fire">{{ $food->foodkcal }}</i>
                        </div>
                    </a>
                </div>
            </div>
        @endforeach
    </div>
</div>
@endsection
