@extends('layouts.index')
@section('content')
    <div class="text-center mt-5">
        <img src="{{ asset('img/exercise/ex.jpg') }}" class="rounded" alt="...">
    </div>
    <div class="container mt-3">
        <h1>การออกกำลังกายสำหรับผู้สูงอายุ</h1>
        <p style="text-indent: 50px;">เมื่อคนเราอายุมากขึ้นมักจะเกิดภาวะกระดูกพรุน กระดูกจะบางกว่าคนหนุ่มสาว
            ฉนั้นการหกล้มในผู้สูงวัยจึงไม่ใช่เรื่องธรรมดาที่จะมองข้ามไปได้ โดยเฉพาะในผู้ที่มีอายุมากกว่า 65 ปี ขึ้นไป
            เพราะถ้าเกิดการหกล้มส่วนใหญ่อาการจะรุนแรง เช่นกระดูกข้อมือหัก กระดูกสะโพกหัก
            ถ้าเกิดศีรษะฟาดพื้นก็อาจจะทำให้เกิดเลือดออกในสมอง จนทำให้ช่วยเหลือตัวเองไม่ได้ ต้องพึ่งพิงผู้แล
            หรือถ้าร้ายแรงที่สุดก็ถึงขั้นเสียชีวิตได้</p>
        <p>สำหรับผู้ที่มีอายุ 65 ปีขึ้นไป การป้องกันการหกล้มที่ดีที่สุดคือการออกกำลังกาย เพราะจะช่วยเสริมสร้างความแข็งแรงของ
            กระดูก และกล้ามเนื้อ จากการศึกษาวิจัยพบว่า มีท่าออกกำลังกาย ที่จะช่วยป้องกันการหกล้มได้อย่างแท้จริง</p>
        <p>ในผู้สูงอายุที่ยังสามารถเดินได้ปกติ ไม่มีปัญหาเรื่องข้อ และกระดูกสามารถออกกำลังกาย ตามท่าต่างๆเหล่านี้ได้
            แต่สำหรับผู้สูงอายุที่มีปัญหาเรื่องกระดูก และข้อ แนะนำให้ออกกำลังกายในท่าง่ายๆ เช่น หมุนหัวไหล่ หมุนตัว
            ยกขาขึ้นลง เท่านั้น เพราะนอกจากจะช่วยเรื่องการทรงตัวแล้ว ยังช่วยป้องกันภาวะสมองเสื่อม
            ชะลอความเสื่อมของวัยได้ประมาณ 20 -30 % เมื่อเทียบกับคนที่ไม่ได้ออกกำลังกาย</p>
        <h4>ท่า ออกกำลังกาย ป้องกันหกล้มในผู้สูงวัย</h4>
        <p>1.ท่าบริหารลำตัว : ให้ยืนตัวตรงกางขาออกเล็กน้อย ตามอง ไปข้างหน้า มือเท้าเอว
            ค่อยๆบิดลำตัวช่วงบนไปด้านขวาให้มากที่สุดเท่าที่จะทำได้ โดยไม่บิดสะโพก จากนั้นให้ทำแบบเดียวกันไปทางด้านซ้าย
            ทำซ้ำกัน 10 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.1.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>2.ท่าบริหารข้อเท้า : ตรงนี้ให้นั่งบนเก้าอี้ ให้ยกขาทีละข้าง เริ่มจากขาขวาก่อน
            ยกขึ้นจากพื้นและกระดกปลายเท้าเข้าหาตัว จากนั้นกระดกปลายเท้าลง ทำซ้ำกัน 10 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.2.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>3.ท่ายืนด้วยปลายเท้า : แบบไม่ใช้ราวจับ ยืดแขนขาความกว้างเท่าช่วงไหล่ แฃ้วค่อยๆเขย่งปลายเท้าขึ้นจนสุด
            แล้วค่อยๆวางส้นเท้าลง ท่านี้ให้ทำซ้ำ 10 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.3.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>4.ท่ายืนด้วยส้นเท้า : แบบไม่ใช้ราวจับ ยืนแยกขาความกว้างเท่าวงไหล่ ค่อยๆ ขยับปลายเท้าขึ้น และยืนขึ้นด้วยส้นเท้า
            จากนั้นค่อยๆวางปลายเท้าลง ทำซ้ำ 20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.4.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>5.ท่าย่อเข่า : แบบไม่ใช้ราวจับ ยืนแยกขาเท่าช่วงไหล่ ค่อยๆย่อเข่าลงโดยให้หัวเข่าไปด้านหน้านิ้วหัวแม่เท้า
            แต่อย่าให้เข่ายื่นเกินปลายนิ้วหัวแม่เท้า จนกระทั่งส้นเท้าเริ่มยกจากพื้นให้หยุด และค่อยๆยืดตัวขึ้น ทำซ้ำ 10-20
            ครั้ง</p>
        <img src="{{ asset('img/exercise/1.5.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>6.เดินต่อเท้า : แบบไม่ใช้ราวจับ ยืนตรงมองไปข้างหน้า
            ค่อยเริ่มเดินโดยก้าวเท้าไปไว้ข้างหน้าในลักษณะปลายเท้าต่อส้นเท้า และเดินเช่นนี้ไปเรื่อยๆ จนครบ 10 ก้าว
            จากนั้นกลับหลังหัน เดินต่อเท้าแบบเดียวกันกลับไปจุดเริ่มต้น ทำซ้ำ 10 -20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.6.png') }}" class="rounded mx-auto d-block" alt="...">
        <P>7.ยืนขาเดียว : แบบไม่ใช้ราวจับ ยืนตรงมองไปข้างหน้า ยกขาข้างใดข้างหนึ่งขึ้น และยืนด้วยขาข้างเดียวนาน 10 วินาที
            จากนั้นเปลี่ยนอีกข้าง</P>
        <img src="{{ asset('img/exercise/1.7.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>8.เดินด้วยส้นเท้า : แบบไม่ใช้ราวจับ ให้ยืนตรง มองไปข้างหน้า ค่อยๆยกปลายเท้าขึ้น จนยืนด้วยส้นเท้า
            จากนั้นเดินด้วยส้นเท้าไป 10 ก้าว แล้วค่อยๆลดปลายเท้าลง จากนั้นกลับตัว และทำแบบเดิม ซ้ำๆกัน 10-20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.8.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>9.เดินด้วยปลายเท้า : แบบไม่ใช้ราวจับ ยืนตรงไปข้างหน้า ค่อยๆยกส้นเท้าขึ้นจนยืนด้วยปลายเท้า
            จากนั้นเดินด้วยปลายเท้าไป 10 ก้าว แล้วค่อยๆลดส้นเท้าลง กลับตัว ค่อยๆยกส้นเท้าขึ้นจนยืนด้วยปลายเท้า
            เดินด้วยปลายเท้าไป 10 ก้าว ทำซ้ำ 10-20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.9.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>10.ท่าเดินเลข 8 : เดินตามปกติ แต่เดินวนเป็นเลข 8 ทำซ้ำกัน 10-20 รอบ</p>
        <img src="{{ asset('img/exercise/1.10.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>11.ท่าเดินสไลด์ด้านข้าง : ยืนตรงมองไปข้างหน้า มือเท้าเอว เดินไปทางด้านขวา 10 ก้าว จากนั้นเดินกลับไปทางซ้าย 10
            ก้าว ทำซ้ำกัน 10-20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.11.png') }}" class="rounded mx-auto d-block" alt="...">
        <p>12.ท่าลุกจากเก้าอี้ : ไม่ใช้มือพยุง เริ่มจากนั่งบนเก้าอี้ที่มีพนักพิงแข็งแรง ไม่เคลื่อนไหว และไม่เตี้ยเกินไป
            วางเท้าหลังหัวเข่า ค่อยๆโน้มตัวไปข้างหน้า แล้วลุกขึ้นยืนโดยไม่ใช้มือช่วยพยุง ทำซ้ำ 10-20 ครั้ง</p>
        <img src="{{ asset('img/exercise/1.12.png') }}" class="rounded mx-auto d-block" alt="...">
    @endsection
